{
  "query": "machine learning",
  "updated_at": "2026-02-22T04:09:51.985987",
  "papers": [
    {
      "title": "OpenEarthAgent: A Unified Framework for Tool-Augmented Geospatial Agents",
      "authors": [
        "Akashah Shabbir",
        "Muhammad Umer Sheikh",
        "Muhammad Akhtar Munir",
        "Hiyam Debary",
        "Mustansar Fiaz",
        "Muhammad Zaigham Zaheer",
        "Paolo Fraccaro",
        "Fahad Shahbaz Khan",
        "Muhammad Haris Khan",
        "Xiao Xiang Zhu",
        "Salman Khan"
      ],
      "abstract": "Recent progress in multimodal reasoning has enabled agents that can interpret imagery, connect it with language, and perform structured analytical tasks. Extending such capabilities to the remote sensing domain remains challenging, as models must reason over spatial scale, geographic structures, and multispectral indices while maintaining coherent multi-step logic. To bridge this gap, OpenEarthAgent introduces a unified framework for developing tool-augmented geospatial agents trained on satellite imagery, natural-language queries, and detailed reasoning traces. The training pipeline relies on supervised fine-tuning over structured reasoning trajectories, aligning the model with verified multistep tool interactions across diverse analytical contexts. The accompanying corpus comprises 14,538 training and 1,169 evaluation instances, with more than 100K reasoning steps in the training split and over 7K reasoning steps in the evaluation split. It spans urban, environmental, disaster, and infrastructure domains, and incorporates GIS-based operations alongside index analyses such as NDVI, NBR, and NDBI. Grounded in explicit reasoning traces, the learned agent demonstrates structured reasoning, stable spatial understanding, and interpretable behaviour through tool-driven geospatial interactions across diverse conditions. We report consistent improvements over a strong baseline and competitive performance relative to recent open and closed-source models.",
      "pdf": "https://arxiv.org/pdf/2602.17665v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17665v1",
      "abs_url": "https://arxiv.org/abs/2602.17665v1",
      "published": "2026-02-19"
    },
    {
      "title": "Sink-Aware Pruning for Diffusion Language Models",
      "authors": [
        "Aidar Myrzakhan",
        "Tianyi Li",
        "Bowei Guo",
        "Shengkun Tang",
        "Zhiqiang Shen"
      ],
      "abstract": "Diffusion Language Models (DLMs) incur high inference cost due to iterative denoising, motivating efficient pruning. Existing pruning heuristics largely inherited from autoregressive (AR) LLMs, typically preserve attention sink tokens because AR sinks serve as stable global anchors. We show that this assumption does not hold for DLMs: the attention-sink position exhibits substantially higher variance over the full generation trajectory (measured by how the dominant sink locations shift across timesteps), indicating that sinks are often transient and less structurally essential than in AR models. Based on this observation, we propose ${\\bf \\texttt{Sink-Aware Pruning}}$, which automatically identifies and prunes unstable sinks in DLMs (prior studies usually keep sinks for AR LLMs). Without retraining, our method achieves a better quality-efficiency trade-off and outperforms strong prior pruning baselines under matched compute. Our code is available at https://github.com/VILA-Lab/Sink-Aware-Pruning.",
      "pdf": "https://arxiv.org/pdf/2602.17664v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17664v1",
      "abs_url": "https://arxiv.org/abs/2602.17664v1",
      "published": "2026-02-19"
    },
    {
      "title": "When Vision Overrides Language: Evaluating and Mitigating Counterfactual Failures in VLAs",
      "authors": [
        "Yu Fang",
        "Yuchun Feng",
        "Dong Jing",
        "Jiaqi Liu",
        "Yue Yang",
        "Zhenyu Wei",
        "Daniel Szafir",
        "Mingyu Ding"
      ],
      "abstract": "Vision-Language-Action models (VLAs) promise to ground language instructions in robot control, yet in practice often fail to faithfully follow language. When presented with instructions that lack strong scene-specific supervision, VLAs suffer from counterfactual failures: they act based on vision shortcuts induced by dataset biases, repeatedly executing well-learned behaviors and selecting objects frequently seen during training regardless of language intent. To systematically study it, we introduce LIBERO-CF, the first counterfactual benchmark for VLAs that evaluates language following capability by assigning alternative instructions under visually plausible LIBERO layouts. Our evaluation reveals that counterfactual failures are prevalent yet underexplored across state-of-the-art VLAs. We propose Counterfactual Action Guidance (CAG), a simple yet effective dual-branch inference scheme that explicitly regularizes language conditioning in VLAs. CAG combines a standard VLA policy with a language-unconditioned Vision-Action (VA) module, enabling counterfactual comparison during action selection. This design reduces reliance on visual shortcuts, improves robustness on under-observed tasks, and requires neither additional demonstrations nor modifications to existing architectures or pretrained models. Extensive experiments demonstrate its plug-and-play integration across diverse VLAs and consistent improvements. For example, on LIBERO-CF, CAG improves $π_{0.5}$ by 9.7% in language following accuracy and 3.6% in task success on under-observed tasks using a training-free strategy, with further gains of 15.5% and 8.5%, respectively, when paired with a VA model. In real-world evaluations, CAG reduces counterfactual failures of 9.4% and improves task success by 17.2% on average.",
      "pdf": "https://arxiv.org/pdf/2602.17659v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17659v1",
      "abs_url": "https://arxiv.org/abs/2602.17659v1",
      "published": "2026-02-19"
    },
    {
      "title": "MARS: Margin-Aware Reward-Modeling with Self-Refinement",
      "authors": [
        "Payel Bhattacharjee",
        "Osvaldo Simeone",
        "Ravi Tandon"
      ],
      "abstract": "Reward modeling is a core component of modern alignment pipelines including RLHF and RLAIF, underpinning policy optimization methods including PPO and TRPO. However, training reliable reward models relies heavily on human-labeled preference data, which is costly and limited, motivating the use of data augmentation. Existing augmentation approaches typically operate at the representation or semantic level and remain agnostic to the reward model's estimation difficulty. In this paper, we propose MARS, an adaptive, margin-aware augmentation and sampling strategy that explicitly targets ambiguous and failure modes of the reward model. Our proposed framework, MARS, concentrates augmentation on low-margin (ambiguous) preference pairs where the reward model is most uncertain, and iteratively refines the training distribution via hard-sample augmentation. We provide theoretical guarantees showing that this strategy increases the average curvature of the loss function hence enhance information and improves conditioning, along with empirical results demonstrating consistent gains over uniform augmentation for robust reward modeling.",
      "pdf": "https://arxiv.org/pdf/2602.17658v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17658v1",
      "abs_url": "https://arxiv.org/abs/2602.17658v1",
      "published": "2026-02-19"
    },
    {
      "title": "What Language is This? Ask Your Tokenizer",
      "authors": [
        "Clara Meister",
        "Ahmetcan Yavuz",
        "Pietro Lesci",
        "Tiago Pimentel"
      ],
      "abstract": "Language Identification (LID) is an important component of many multilingual natural language processing pipelines, where it facilitates corpus curation, training data analysis, and cross-lingual evaluation of large language models. Despite near-perfect performance on high-resource languages, existing systems remain brittle in low-resource and closely related language settings. We introduce UniLID, a simple and efficient LID method based on the UnigramLM tokenization algorithm, leveraging its probabilistic framing, parameter estimation technique and inference strategy. In short, we learn language-conditional unigram distributions over a shared tokenizer vocabulary but treat segmentation as a language-specific phenomenon. Our formulation is data- and compute-efficient, supports incremental addition of new languages without retraining existing models, and can naturally be integrated into existing language model tokenization pipelines. Empirical evaluations against widely used baselines, including fastText, GlotLID, and CLD3, show that UniLID achieves competitive performance on standard benchmarks, substantially improves sample efficiency in low-resource settings - surpassing 70% accuracy with as few as five labeled samples per language - and delivers large gains on fine-grained dialect identification.",
      "pdf": "https://arxiv.org/pdf/2602.17655v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17655v1",
      "abs_url": "https://arxiv.org/abs/2602.17655v1",
      "published": "2026-02-19"
    },
    {
      "title": "Mine and Refine: Optimizing Graded Relevance in E-commerce Search Retrieval",
      "authors": [
        "Jiaqi Xi",
        "Raghav Saboo",
        "Luming Chen",
        "Martin Wang",
        "Sudeep Das"
      ],
      "abstract": "We propose a two-stage \"Mine and Refine\" contrastive training framework for semantic text embeddings to enhance multi-category e-commerce search retrieval. Large scale e-commerce search demands embeddings that generalize to long tail, noisy queries while adhering to scalable supervision compatible with product and policy constraints. A practical challenge is that relevance is often graded: users accept substitutes or complements beyond exact matches, and production systems benefit from clear separation of similarity scores across these relevance strata for stable hybrid blending and thresholding. To obtain scalable policy consistent supervision, we fine-tune a lightweight LLM on human annotations under a three-level relevance guideline and further reduce residual noise via engagement driven auditing. In Stage 1, we train a multilingual Siamese two-tower retriever with a label aware supervised contrastive objective that shapes a robust global semantic space. In Stage 2, we mine hard samples via ANN and re-annotate them with the policy aligned LLM, and introduce a multi-class extension of circle loss that explicitly sharpens similarity boundaries between relevance levels, to further refine and enrich the embedding space. Robustness is additionally improved through additive spelling augmentation and synthetic query generation. Extensive offline evaluations and production A/B tests show that our framework improves retrieval relevance and delivers statistically significant gains in engagement and business impact.",
      "pdf": "https://arxiv.org/pdf/2602.17654v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17654v1",
      "abs_url": "https://arxiv.org/abs/2602.17654v1",
      "published": "2026-02-19"
    },
    {
      "title": "Differences in Typological Alignment in Language Models' Treatment of Differential Argument Marking",
      "authors": [
        "Iskar Deng",
        "Nathalia Xu",
        "Shane Steinert-Threlkeld"
      ],
      "abstract": "Recent work has shown that language models (LMs) trained on synthetic corpora can exhibit typological preferences that resemble cross-linguistic regularities in human languages, particularly for syntactic phenomena such as word order. In this paper, we extend this paradigm to differential argument marking (DAM), a semantic licensing system in which morphological marking depends on semantic prominence. Using a controlled synthetic learning method, we train GPT-2 models on 18 corpora implementing distinct DAM systems and evaluate their generalization using minimal pairs. Our results reveal a dissociation between two typological dimensions of DAM. Models reliably exhibit human-like preferences for natural markedness direction, favoring systems in which overt marking targets semantically atypical arguments. In contrast, models do not reproduce the strong object preference in human languages, in which overt marking in DAM more often targets objects rather than subjects. These findings suggest that different typological tendencies may arise from distinct underlying sources.",
      "pdf": "https://arxiv.org/pdf/2602.17653v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17653v1",
      "abs_url": "https://arxiv.org/abs/2602.17653v1",
      "published": "2026-02-19"
    },
    {
      "title": "Human-level 3D shape perception emerges from multi-view learning",
      "authors": [
        "Tyler Bonnen",
        "Jitendra Malik",
        "Angjoo Kanazawa"
      ],
      "abstract": "Humans can infer the three-dimensional structure of objects from two-dimensional visual inputs. Modeling this ability has been a longstanding goal for the science and engineering of visual intelligence, yet decades of computational methods have fallen short of human performance. Here we develop a modeling framework that predicts human 3D shape inferences for arbitrary objects, directly from experimental stimuli. We achieve this with a novel class of neural networks trained using a visual-spatial objective over naturalistic sensory data; given a set of images taken from different locations within a natural scene, these models learn to predict spatial information related to these images, such as camera location and visual depth, without relying on any object-related inductive biases. Notably, these visual-spatial signals are analogous to sensory cues readily available to humans. We design a zero-shot evaluation approach to determine the performance of these `multi-view' models on a well established 3D perception task, then compare model and human behavior. Our modeling framework is the first to match human accuracy on 3D shape inferences, even without task-specific training or fine-tuning. Remarkably, independent readouts of model responses predict fine-grained measures of human behavior, including error patterns and reaction times, revealing a natural correspondence between model dynamics and human perception. Taken together, our findings indicate that human-level 3D perception can emerge from a simple, scalable learning objective over naturalistic visual-spatial data. All code, human behavioral data, and experimental stimuli needed to reproduce our findings can be found on our project page.",
      "pdf": "https://arxiv.org/pdf/2602.17650v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17650v1",
      "abs_url": "https://arxiv.org/abs/2602.17650v1",
      "published": "2026-02-19"
    },
    {
      "title": "Multi-Round Human-AI Collaboration with User-Specified Requirements",
      "authors": [
        "Sima Noorani",
        "Shayan Kiyani",
        "Hamed Hassani",
        "George Pappas"
      ],
      "abstract": "As humans increasingly rely on multiround conversational AI for high stakes decisions, principled frameworks are needed to ensure such interactions reliably improve decision quality. We adopt a human centric view governed by two principles: counterfactual harm, ensuring the AI does not undermine human strengths, and complementarity, ensuring it adds value where the human is prone to err. We formalize these concepts via user defined rules, allowing users to specify exactly what harm and complementarity mean for their specific task. We then introduce an online, distribution free algorithm with finite sample guarantees that enforces the user-specified constraints over the collaboration dynamics. We evaluate our framework across two interactive settings: LLM simulated collaboration on a medical diagnostic task and a human crowdsourcing study on a pictorial reasoning task. We show that our online procedure maintains prescribed counterfactual harm and complementarity violation rates even under nonstationary interaction dynamics. Moreover, tightening or loosening these constraints produces predictable shifts in downstream human accuracy, confirming that the two principles serve as practical levers for steering multi-round collaboration toward better decision quality without the need to model or constrain human behavior.",
      "pdf": "https://arxiv.org/pdf/2602.17646v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17646v1",
      "abs_url": "https://arxiv.org/abs/2602.17646v1",
      "published": "2026-02-19"
    },
    {
      "title": "Pushing the Frontier of Black-Box LVLM Attacks via Fine-Grained Detail Targeting",
      "authors": [
        "Xiaohan Zhao",
        "Zhaoyi Li",
        "Yaxin Luo",
        "Jiacheng Cui",
        "Zhiqiang Shen"
      ],
      "abstract": "Black-box adversarial attacks on Large Vision-Language Models (LVLMs) are challenging due to missing gradients and complex multimodal boundaries. While prior state-of-the-art transfer-based approaches like M-Attack perform well using local crop-level matching between source and target images, we find this induces high-variance, nearly orthogonal gradients across iterations, violating coherent local alignment and destabilizing optimization. We attribute this to (i) ViT translation sensitivity that yields spike-like gradients and (ii) structural asymmetry between source and target crops. We reformulate local matching as an asymmetric expectation over source transformations and target semantics, and build a gradient-denoising upgrade to M-Attack. On the source side, Multi-Crop Alignment (MCA) averages gradients from multiple independently sampled local views per iteration to reduce variance. On the target side, Auxiliary Target Alignment (ATA) replaces aggressive target augmentation with a small auxiliary set from a semantically correlated distribution, producing a smoother, lower-variance target manifold. We further reinterpret momentum as Patch Momentum, replaying historical crop gradients; combined with a refined patch-size ensemble (PE+), this strengthens transferable directions. Together these modules form M-Attack-V2, a simple, modular enhancement over M-Attack that substantially improves transfer-based black-box attacks on frontier LVLMs: boosting success rates on Claude-4.0 from 8% to 30%, Gemini-2.5-Pro from 83% to 97%, and GPT-5 from 98% to 100%, outperforming prior black-box LVLM attacks. Code and data are publicly available at: https://github.com/vila-lab/M-Attack-V2.",
      "pdf": "https://arxiv.org/pdf/2602.17645v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17645v1",
      "abs_url": "https://arxiv.org/abs/2602.17645v1",
      "published": "2026-02-19"
    },
    {
      "title": "A.R.I.S.: Automated Recycling Identification System for E-Waste Classification Using Deep Learning",
      "authors": [
        "Dhruv Talwar",
        "Harsh Desai",
        "Wendong Yin",
        "Goutam Mohanty",
        "Rafael Reveles"
      ],
      "abstract": "Traditional electronic recycling processes suffer from significant resource loss due to inadequate material separation and identification capabilities, limiting material recovery. We present A.R.I.S. (Automated Recycling Identification System), a low-cost, portable sorter for shredded e-waste that addresses this efficiency gap. The system employs a YOLOx model to classify metals, plastics, and circuit boards in real time, achieving low inference latency with high detection accuracy. Experimental evaluation yielded 90% overall precision, 82.2% mean average precision (mAP), and 84% sortation purity. By integrating deep learning with established sorting methods, A.R.I.S. enhances material recovery efficiency and lowers barriers to advanced recycling adoption. This work complements broader initiatives in extending product life cycles, supporting trade-in and recycling programs, and reducing environmental impact across the supply chain.",
      "pdf": "https://arxiv.org/pdf/2602.17642v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17642v1",
      "abs_url": "https://arxiv.org/abs/2602.17642v1",
      "published": "2026-02-19"
    },
    {
      "title": "FAMOSE: A ReAct Approach to Automated Feature Discovery",
      "authors": [
        "Keith Burghardt",
        "Jienan Liu",
        "Sadman Sakib",
        "Yuning Hao",
        "Bo Li"
      ],
      "abstract": "Feature engineering remains a critical yet challenging bottleneck in machine learning, particularly for tabular data, as identifying optimal features from an exponentially large feature space traditionally demands substantial domain expertise. To address this challenge, we introduce FAMOSE (Feature AugMentation and Optimal Selection agEnt), a novel framework that leverages the ReAct paradigm to autonomously explore, generate, and refine features while integrating feature selection and evaluation tools within an agent architecture. To our knowledge, FAMOSE represents the first application of an agentic ReAct framework to automated feature engineering, especially for both regression and classification tasks. Extensive experiments demonstrate that FAMOSE is at or near the state-of-the-art on classification tasks (especially tasks with more than 10K instances, where ROC-AUC increases 0.23% on average), and achieves the state-of-the-art for regression tasks by reducing RMSE by 2.0% on average, while remaining more robust to errors than other algorithms. We hypothesize that FAMOSE's strong performance is because ReAct allows the LLM context window to record (via iterative feature discovery and evaluation steps) what features did or did not work. This is similar to a few-shot prompt and guides the LLM to invent better, more innovative features. Our work offers evidence that AI agents are remarkably effective in solving problems that require highly inventive solutions, such as feature engineering.",
      "pdf": "https://arxiv.org/pdf/2602.17641v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17641v1",
      "abs_url": "https://arxiv.org/abs/2602.17641v1",
      "published": "2026-02-19"
    },
    {
      "title": "Reverso: Efficient Time Series Foundation Models for Zero-shot Forecasting",
      "authors": [
        "Xinghong Fu",
        "Yanhong Li",
        "Georgios Papaioannou",
        "Yoon Kim"
      ],
      "abstract": "Learning time series foundation models has been shown to be a promising approach for zero-shot time series forecasting across diverse time series domains. Insofar as scaling has been a critical driver of performance of foundation models in other modalities such as language and vision, much recent work on time series foundation modeling has focused on scaling. This has resulted in time series foundation models with hundreds of millions of parameters that are, while performant, inefficient and expensive to use in practice. This paper describes a simple recipe for learning efficient foundation models for zero-shot time series forecasting that are orders of magnitude smaller. We show that large-scale transformers are not necessary: small hybrid models that interleave long convolution and linear RNN layers (in particular DeltaNet layers) can match the performance of larger transformer-based models while being more than a hundred times smaller. We also describe several data augmentation and inference strategies that further improve performance. This recipe results in Reverso, a family of efficient time series foundation models for zero-shot forecasting that significantly push the performance-efficiency Pareto frontier.",
      "pdf": "https://arxiv.org/pdf/2602.17634v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17634v1",
      "abs_url": "https://arxiv.org/abs/2602.17634v1",
      "published": "2026-02-19"
    },
    {
      "title": "When to Trust the Cheap Check: Weak and Strong Verification for Reasoning",
      "authors": [
        "Shayan Kiyani",
        "Sima Noorani",
        "George Pappas",
        "Hamed Hassani"
      ],
      "abstract": "Reasoning with LLMs increasingly unfolds inside a broader verification loop. Internally, systems use cheap checks, such as self-consistency or proxy rewards, which we call weak verification. Externally, users inspect outputs and steer the model through feedback until results are trustworthy, which we call strong verification. These signals differ sharply in cost and reliability: strong verification can establish trust but is resource-intensive, while weak verification is fast and scalable but noisy and imperfect. We formalize this tension through weak--strong verification policies, which decide when to accept or reject based on weak verification and when to defer to strong verification. We introduce metrics capturing incorrect acceptance, incorrect rejection, and strong-verification frequency. Over population, we show that optimal policies admit a two-threshold structure and that calibration and sharpness govern the value of weak verifiers. Building on this, we develop an online algorithm that provably controls acceptance and rejection errors without assumptions on the query stream, the language model, or the weak verifier.",
      "pdf": "https://arxiv.org/pdf/2602.17633v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17633v1",
      "abs_url": "https://arxiv.org/abs/2602.17633v1",
      "published": "2026-02-19"
    },
    {
      "title": "SMAC: Score-Matched Actor-Critics for Robust Offline-to-Online Transfer",
      "authors": [
        "Nathan S. de Lara",
        "Florian Shkurti"
      ],
      "abstract": "Modern offline Reinforcement Learning (RL) methods find performant actor-critics, however, fine-tuning these actor-critics online with value-based RL algorithms typically causes immediate drops in performance. We provide evidence consistent with the hypothesis that, in the loss landscape, offline maxima for prior algorithms and online maxima are separated by low-performance valleys that gradient-based fine-tuning traverses. Following this, we present Score Matched Actor-Critic (SMAC), an offline RL method designed to learn actor-critics that transition to online value-based RL algorithms with no drop in performance. SMAC avoids valleys between offline and online maxima by regularizing the Q-function during the offline phase to respect a first-order derivative equality between the score of the policy and action-gradient of the Q-function. We experimentally demonstrate that SMAC converges to offline maxima that are connected to better online maxima via paths with monotonically increasing reward found by first-order optimization. SMAC achieves smooth transfer to Soft Actor-Critic and TD3 in 6/6 D4RL tasks. In 4/6 environments, it reduces regret by 34-58% over the best baseline.",
      "pdf": "https://arxiv.org/pdf/2602.17632v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17632v1",
      "abs_url": "https://arxiv.org/abs/2602.17632v1",
      "published": "2026-02-19"
    },
    {
      "title": "Catastrophic Forgetting Resilient One-Shot Incremental Federated Learning",
      "authors": [
        "Obaidullah Zaland",
        "Zulfiqar Ahmad Khan",
        "Monowar Bhuyan"
      ],
      "abstract": "Modern big-data systems generate massive, heterogeneous, and geographically dispersed streams that are large-scale and privacy-sensitive, making centralization challenging. While federated learning (FL) provides a privacy-enhancing training mechanism, it assumes a static data flow and learns a collaborative model over multiple rounds, making learning with \\textit{incremental} data challenging in limited-communication scenarios. This paper presents One-Shot Incremental Federated Learning (OSI-FL), the first FL framework that addresses the dual challenges of communication overhead and catastrophic forgetting. OSI-FL communicates category-specific embeddings, devised by a frozen vision-language model (VLM) from each client in a single communication round, which a pre-trained diffusion model at the server uses to synthesize new data similar to the client's data distribution. The synthesized samples are used on the server for training. However, two challenges still persist: i) tasks arriving incrementally need to retrain the global model, and ii) as future tasks arrive, retraining the model introduces catastrophic forgetting. To this end, we augment training with Selective Sample Retention (SSR), which identifies and retains the top-p most informative samples per category and task pair based on sample loss. SSR bounds forgetting by ensuring that representative retained samples are incorporated into training in further iterations. The experimental results indicate that OSI-FL outperforms baselines, including traditional and one-shot FL approaches, in both class-incremental and domain-incremental scenarios across three benchmark datasets.",
      "pdf": "https://arxiv.org/pdf/2602.17625v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17625v1",
      "abs_url": "https://arxiv.org/abs/2602.17625v1",
      "published": "2026-02-19"
    },
    {
      "title": "Global Self-Attention with Exact Fourier Propagation for Phase-Only Far-Field Holography",
      "authors": [
        "Dilawer Singh",
        "Antoni J. Wojcik",
        "Timothy D. Wilkinson"
      ],
      "abstract": "Phase-only computer-generated holography (CGH) seeks a phase pattern for a spatial light modulator (SLM) whose propagated optical field reproduces a desired intensity distribution. In the far-field (Fraunhofer) regime, optical propagation reduces to a Fourier transform, such that each hologram pixel contributes to the entire reconstructed intensity distribution. When restricted to phase-only modulation, intensity must be shaped through global phase interference effects, making the inverse mapping from target intensity to phase highly non-linear and sensitive to local minima. We present a proof-of-concept physics-in-the-loop approach in which a transformer maps a target intensity image to a phase-only SLM field and is trained end-to-end through exact FFT-based propagation embedded directly within optimization. We further observe that patch tokenization strongly shapes the optimization geometry: coarse tokenization acts as an implicit spectral regularizer that stabilizes training and suppresses checkerboard-like attractors, while finer tokenization increases spatial degrees of freedom but benefits from curriculum or hierarchical refinement. Despite training on limited primitives and restricted digit subsets, the learned generator exhibits out-of-distribution (OOD) generalization to unseen digits and hand-drawn target patterns. These results suggest that transformer architectures, whose self-attention enables global token interactions, are a natural fit for far-field holography and provide a viable foundation for scalable physics-grounded hologram generation.",
      "pdf": "https://arxiv.org/pdf/2602.17624v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17624v1",
      "abs_url": "https://arxiv.org/abs/2602.17624v1",
      "published": "2026-02-19"
    },
    {
      "title": "Unmasking the Factual-Conceptual Gap in Persian Language Models",
      "authors": [
        "Alireza Sakhaeirad",
        "Ali Ma'manpoosh",
        "Arshia Hemmat"
      ],
      "abstract": "While emerging Persian NLP benchmarks have expanded into pragmatics and politeness, they rarely distinguish between memorized cultural facts and the ability to reason about implicit social norms. We introduce DivanBench, a diagnostic benchmark focused on superstitions and customs, arbitrary, context-dependent rules that resist simple logical deduction. Through 315 questions across three task types (factual retrieval, paired scenario verification, and situational reasoning), we evaluate seven Persian LLMs and reveal three critical failures: most models exhibit severe acquiescence bias, correctly identifying appropriate behaviors but failing to reject clear violations; continuous Persian pretraining amplifies this bias rather than improving reasoning, often degrading the model's ability to discern contradictions; and all models show a 21\\% performance gap between retrieving factual knowledge and applying it in scenarios. These findings demonstrate that cultural competence requires more than scaling monolingual data, as current models learn to mimic cultural patterns without internalizing the underlying schemas.",
      "pdf": "https://arxiv.org/pdf/2602.17623v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17623v1",
      "abs_url": "https://arxiv.org/abs/2602.17623v1",
      "published": "2026-02-19"
    },
    {
      "title": "EDRP: Enhanced Dynamic Relay Point Protocol for Data Dissemination in Multi-hop Wireless IoT Networks",
      "authors": [
        "Jothi Prasanna Shanmuga Sundaram",
        "Magzhan Gabidolla",
        "Luis Fujarte",
        "Shawn Duong",
        "Jianlin Guo",
        "Toshiaki Koike-Akino",
        "Pu",
        "Wang",
        "Kieran Parsons",
        "Philip V. Orlik",
        "Takenori Sumi",
        "Yukimasa Nagai",
        "Miguel A. Carreira-Perpinan",
        "Alberto E. Cerpa"
      ],
      "abstract": "Emerging IoT applications are transitioning from battery-powered to grid-powered nodes. DRP, a contention-based data dissemination protocol, was developed for these applications. Traditional contention-based protocols resolve collisions through control packet exchanges, significantly reducing goodput. DRP mitigates this issue by employing a distributed delay timer mechanism that assigns transmission-start delays based on the average link quality between a sender and its children, prioritizing highly connected nodes for early transmission. However, our in-field experiments reveal that DRP is unable to accommodate real-world link quality fluctuations, leading to overlapping transmissions from multiple senders. This overlap triggers CSMA's random back-off delays, ultimately degrading the goodput performance.\n  To address these shortcomings, we first conduct a theoretical analysis that characterizes the design requirements induced by real-world link quality fluctuations and DRP's passive acknowledgments. Guided by this analysis, we design EDRP, which integrates two novel components: (i) Link-Quality Aware CSMA (LQ-CSMA) and (ii) a Machine Learning-based Block Size Selection (ML-BSS) algorithm for rateless codes. LQ-CSMA dynamically restricts the back-off delay range based on real-time link quality estimates, ensuring that nodes with stronger connectivity experience shorter delays. ML-BSS algorithm predicts future link quality conditions and optimally adjusts the block size for rateless coding, reducing overhead and enhancing goodput. In-field evaluations of EDRP demonstrate an average goodput improvement of 39.43\\% than the competing protocols.",
      "pdf": "https://arxiv.org/pdf/2602.17619v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17619v1",
      "abs_url": "https://arxiv.org/abs/2602.17619v1",
      "published": "2026-02-19"
    },
    {
      "title": "Stable Asynchrony: Variance-Controlled Off-Policy RL for LLMs",
      "authors": [
        "Luke Huang",
        "Zhuoyang Zhang",
        "Qinghao Hu",
        "Shang Yang",
        "Song Han"
      ],
      "abstract": "Reinforcement learning (RL) is widely used to improve large language models on reasoning tasks, and asynchronous RL training is attractive because it increases end-to-end throughput. However, for widely adopted critic-free policy-gradient methods such as REINFORCE and GRPO, high asynchrony makes the policy-gradient estimator markedly $\\textbf{higher variance}$: training on stale rollouts creates heavy-tailed importance ratios, causing a small fraction of samples to dominate updates. This amplification makes gradients noisy and learning unstable relative to matched on-policy training. Across math and general reasoning benchmarks, we find collapse is reliably predicted by effective sample size (ESS) and unstable gradient norms. Motivated by this diagnosis, we propose $\\textbf{V}$ariance $\\textbf{C}$ontrolled $\\textbf{P}$olicy $\\textbf{O}$ptimization ($\\textbf{VCPO}$), a general stabilization method for REINFORCE/GRPO-style algorithms that (i) scales learning rate based on effective sample size to dampen unreliable updates, and (ii) applies a closed-form minimum-variance baseline for the off-policy setting, avoiding an auxiliary value model and adding minimal overhead. Empirically, VCPO substantially improves robustness for asynchronous training across math, general reasoning, and tool-use tasks, outperforming a broad suite of baselines spanning masking/clipping stabilizers and algorithmic variants. This reduces long-context, multi-turn training time by 2.5$\\times$ while matching synchronous performance, demonstrating that explicit control of policy-gradient variance is key for reliable asynchronous RL at scale.",
      "pdf": "https://arxiv.org/pdf/2602.17616v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17616v1",
      "abs_url": "https://arxiv.org/abs/2602.17616v1",
      "published": "2026-02-19"
    },
    {
      "title": "Guarding the Middle: Protecting Intermediate Representations in Federated Split Learning",
      "authors": [
        "Obaidullah Zaland",
        "Sajib Mistry",
        "Monowar Bhuyan"
      ],
      "abstract": "Big data scenarios, where massive, heterogeneous datasets are distributed across clients, demand scalable, privacy-preserving learning methods. Federated learning (FL) enables decentralized training of machine learning (ML) models across clients without data centralization. Decentralized training, however, introduces a computational burden on client devices. U-shaped federated split learning (UFSL) offloads a fraction of the client computation to the server while keeping both data and labels on the clients' side. However, the intermediate representations (i.e., smashed data) shared by clients with the server are prone to exposing clients' private data. To reduce exposure of client data through intermediate data representations, this work proposes k-anonymous differentially private UFSL (KD-UFSL), which leverages privacy-enhancing techniques such as microaggregation and differential privacy to minimize data leakage from the smashed data transferred to the server. We first demonstrate that an adversary can access private client data from intermediate representations via a data-reconstruction attack, and then present a privacy-enhancing solution, KD-UFSL, to mitigate this risk. Our experiments indicate that, alongside increasing the mean squared error between the actual and reconstructed images by up to 50% in some cases, KD-UFSL also decreases the structural similarity between them by up to 40% on four benchmarking datasets. More importantly, KD-UFSL improves privacy while preserving the utility of the global model. This highlights its suitability for large-scale big data applications where privacy and utility must be balanced.",
      "pdf": "https://arxiv.org/pdf/2602.17614v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17614v1",
      "abs_url": "https://arxiv.org/abs/2602.17614v1",
      "published": "2026-02-19"
    },
    {
      "title": "Towards Anytime-Valid Statistical Watermarking",
      "authors": [
        "Baihe Huang",
        "Eric Xu",
        "Kannan Ramchandran",
        "Jiantao Jiao",
        "Michael I. Jordan"
      ],
      "abstract": "The proliferation of Large Language Models (LLMs) necessitates efficient mechanisms to distinguish machine-generated content from human text. While statistical watermarking has emerged as a promising solution, existing methods suffer from two critical limitations: the lack of a principled approach for selecting sampling distributions and the reliance on fixed-horizon hypothesis testing, which precludes valid early stopping. In this paper, we bridge this gap by developing the first e-value-based watermarking framework, Anchored E-Watermarking, that unifies optimal sampling with anytime-valid inference. Unlike traditional approaches where optional stopping invalidates Type-I error guarantees, our framework enables valid, anytime-inference by constructing a test supermartingale for the detection process. By leveraging an anchor distribution to approximate the target model, we characterize the optimal e-value with respect to the worst-case log-growth rate and derive the optimal expected stopping time. Our theoretical claims are substantiated by simulations and evaluations on established benchmarks, showing that our framework can significantly enhance sample efficiency, reducing the average token budget required for detection by 13-15% relative to state-of-the-art baselines.",
      "pdf": "https://arxiv.org/pdf/2602.17608v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17608v1",
      "abs_url": "https://arxiv.org/abs/2602.17608v1",
      "published": "2026-02-19"
    },
    {
      "title": "AutoNumerics: An Autonomous, PDE-Agnostic Multi-Agent Pipeline for Scientific Computing",
      "authors": [
        "Jianda Du",
        "Youran Sun",
        "Haizhao Yang"
      ],
      "abstract": "PDEs are central to scientific and engineering modeling, yet designing accurate numerical solvers typically requires substantial mathematical expertise and manual tuning. Recent neural network-based approaches improve flexibility but often demand high computational cost and suffer from limited interpretability. We introduce \\texttt{AutoNumerics}, a multi-agent framework that autonomously designs, implements, debugs, and verifies numerical solvers for general PDEs directly from natural language descriptions. Unlike black-box neural solvers, our framework generates transparent solvers grounded in classical numerical analysis. We introduce a coarse-to-fine execution strategy and a residual-based self-verification mechanism. Experiments on 24 canonical and real-world PDE problems demonstrate that \\texttt{AutoNumerics} achieves competitive or superior accuracy compared to existing neural and LLM-based baselines, and correctly selects numerical schemes based on PDE structural properties, suggesting its viability as an accessible paradigm for automated PDE solving.",
      "pdf": "https://arxiv.org/pdf/2602.17607v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17607v1",
      "abs_url": "https://arxiv.org/abs/2602.17607v1",
      "published": "2026-02-19"
    },
    {
      "title": "Adapting Actively on the Fly: Relevance-Guided Online Meta-Learning with Latent Concepts for Geospatial Discovery",
      "authors": [
        "Jowaria Khan",
        "Anindya Sarkar",
        "Yevgeniy Vorobeychik",
        "Elizabeth Bondi-Kelly"
      ],
      "abstract": "In many real-world settings, such as environmental monitoring, disaster response, or public health, with costly and difficult data collection and dynamic environments, strategically sampling from unobserved regions is essential for efficiently uncovering hidden targets under tight resource constraints. Yet, sparse and biased geospatial ground truth limits the applicability of existing learning-based methods, such as reinforcement learning. To address this, we propose a unified geospatial discovery framework that integrates active learning, online meta-learning, and concept-guided reasoning. Our approach introduces two key innovations built on a shared notion of *concept relevance*, which captures how domain-specific factors influence target presence: a *concept-weighted uncertainty sampling strategy*, where uncertainty is modulated by learned relevance based on readily-available domain-specific concepts (e.g., land cover, source proximity); and a *relevance-aware meta-batch formation strategy* that promotes semantic diversity during online-meta updates, improving generalization in dynamic environments. Our experiments include testing on a real-world dataset of cancer-causing PFAS (Per- and polyfluoroalkyl substances) contamination, showcasing our method's reliability at uncovering targets with limited data and a varying environment.",
      "pdf": "https://arxiv.org/pdf/2602.17605v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17605v1",
      "abs_url": "https://arxiv.org/abs/2602.17605v1",
      "published": "2026-02-19"
    },
    {
      "title": "SOLVAR: Fast covariance-based heterogeneity analysis with pose refinement for cryo-EM",
      "authors": [
        "Roey Yadgar",
        "Roy R. Lederman",
        "Yoel Shkolnisky"
      ],
      "abstract": "Cryo-electron microscopy (cryo-EM) has emerged as a powerful technique for resolving the three-dimensional structures of macromolecules. A key challenge in cryo-EM is characterizing continuous heterogeneity, where molecules adopt a continuum of conformational states. Covariance-based methods offer a principled approach to modeling structural variability. However, estimating the covariance matrix efficiently remains a challenging computational task. In this paper, we present SOLVAR (Stochastic Optimization for Low-rank Variability Analysis), which leverages a low-rank assumption on the covariance matrix to provide a tractable estimator for its principal components, despite the apparently prohibitive large size of the covariance matrix. Under this low-rank assumption, our estimator can be formulated as an optimization problem that can be solved quickly and accurately. Moreover, our framework enables refinement of the poses of the input particle images, a capability absent from most heterogeneity-analysis methods, and all covariance-based methods. Numerical experiments on both synthetic and experimental datasets demonstrate that the algorithm accurately captures dominant components of variability while maintaining computational efficiency. SOLVAR achieves state-of-the-art performance across multiple datasets in a recent heterogeneity benchmark. The code of the algorithm is freely available at https://github.com/RoeyYadgar/SOLVAR.",
      "pdf": "https://arxiv.org/pdf/2602.17603v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17603v1",
      "abs_url": "https://arxiv.org/abs/2602.17603v1",
      "published": "2026-02-19"
    },
    {
      "title": "Art2Mus: Artwork-to-Music Generation via Visual Conditioning and Large-Scale Cross-Modal Alignment",
      "authors": [
        "Ivan Rinaldi",
        "Matteo Mendula",
        "Nicola Fanelli",
        "Florence Levé",
        "Matteo Testi",
        "Giovanna Castellano",
        "Gennaro Vessio"
      ],
      "abstract": "Music generation has advanced markedly through multimodal deep learning, enabling models to synthesize audio from text and, more recently, from images. However, existing image-conditioned systems suffer from two fundamental limitations: (i) they are typically trained on natural photographs, limiting their ability to capture the richer semantic, stylistic, and cultural content of artworks; and (ii) most rely on an image-to-text conversion stage, using language as a semantic shortcut that simplifies conditioning but prevents direct visual-to-audio learning. Motivated by these gaps, we introduce ArtSound, a large-scale multimodal dataset of 105,884 artwork-music pairs enriched with dual-modality captions, obtained by extending ArtGraph and the Free Music Archive. We further propose ArtToMus, the first framework explicitly designed for direct artwork-to-music generation, which maps digitized artworks to music without image-to-text translation or language-based semantic supervision. The framework projects visual embeddings into the conditioning space of a latent diffusion model, enabling music synthesis guided solely by visual information. Experimental results show that ArtToMus generates musically coherent and stylistically consistent outputs that reflect salient visual cues of the source artworks. While absolute alignment scores remain lower than those of text-conditioned systems-as expected given the substantially increased difficulty of removing linguistic supervision-ArtToMus achieves competitive perceptual quality and meaningful cross-modal correspondence. This work establishes direct visual-to-music generation as a distinct and challenging research direction, and provides resources that support applications in multimedia art, cultural heritage, and AI-assisted creative practice. Code and dataset will be publicly released upon acceptance.",
      "pdf": "https://arxiv.org/pdf/2602.17599v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17599v1",
      "abs_url": "https://arxiv.org/abs/2602.17599v1",
      "published": "2026-02-19"
    },
    {
      "title": "Asymptotic Smoothing of the Lipschitz Loss Landscape in Overparameterized One-Hidden-Layer ReLU Networks",
      "authors": [
        "Saveliy Baturin"
      ],
      "abstract": "We study the topology of the loss landscape of one-hidden-layer ReLU networks under overparameterization. On the theory side, we (i) prove that for convex $L$-Lipschitz losses with an $\\ell_1$-regularized second layer, every pair of models at the same loss level can be connected by a continuous path within an arbitrarily small loss increase $ε$ (extending a known result for the quadratic loss); (ii) obtain an asymptotic upper bound on the energy gap $ε$ between local and global minima that vanishes as the width $m$ grows, implying that the landscape flattens and sublevel sets become connected in the limit. Empirically, on a synthetic Moons dataset and on the Wisconsin Breast Cancer dataset, we measure pairwise energy gaps via Dynamic String Sampling (DSS) and find that wider networks exhibit smaller gaps; in particular, a permutation test on the maximum gap yields $p_{perm}=0$, indicating a clear reduction in the barrier height.",
      "pdf": "https://arxiv.org/pdf/2602.17596v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17596v1",
      "abs_url": "https://arxiv.org/abs/2602.17596v1",
      "published": "2026-02-19"
    },
    {
      "title": "AI Gamestore: Scalable, Open-Ended Evaluation of Machine General Intelligence with Human Games",
      "authors": [
        "Lance Ying",
        "Ryan Truong",
        "Prafull Sharma",
        "Kaiya Ivy Zhao",
        "Nathan Cloos",
        "Kelsey R. Allen",
        "Thomas L. Griffiths",
        "Katherine M. Collins",
        "José Hernández-Orallo",
        "Phillip Isola",
        "Samuel J. Gershman",
        "Joshua B. Tenenbaum"
      ],
      "abstract": "Rigorously evaluating machine intelligence against the broad spectrum of human general intelligence has become increasingly important and challenging in this era of rapid technological advance. Conventional AI benchmarks typically assess only narrow capabilities in a limited range of human activity. Most are also static, quickly saturating as developers explicitly or implicitly optimize for them. We propose that a more promising way to evaluate human-like general intelligence in AI systems is through a particularly strong form of general game playing: studying how and how well they play and learn to play \\textbf{all conceivable human games}, in comparison to human players with the same level of experience, time, or other resources. We define a \"human game\" to be a game designed by humans for humans, and argue for the evaluative suitability of this space of all such games people can imagine and enjoy -- the \"Multiverse of Human Games\". Taking a first step towards this vision, we introduce the AI GameStore, a scalable and open-ended platform that uses LLMs with humans-in-the-loop to synthesize new representative human games, by automatically sourcing and adapting standardized and containerized variants of game environments from popular human digital gaming platforms. As a proof of concept, we generated 100 such games based on the top charts of Apple App Store and Steam, and evaluated seven frontier vision-language models (VLMs) on short episodes of play. The best models achieved less than 10\\% of the human average score on the majority of the games, and especially struggled with games that challenge world-model learning, memory and planning. We conclude with a set of next steps for building out the AI GameStore as a practical way to measure and drive progress toward human-like general intelligence in machines.",
      "pdf": "https://arxiv.org/pdf/2602.17594v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17594v1",
      "abs_url": "https://arxiv.org/abs/2602.17594v1",
      "published": "2026-02-19"
    },
    {
      "title": "Quantum Advantage for Sensing Properties of Classical Fields",
      "authors": [
        "Jordan Cotler",
        "Daine L. Danielson",
        "Ishaan Kannan"
      ],
      "abstract": "Modern precision experiments often probe unknown classical fields with bosonic sensors in quantum-noise-limited regimes where vacuum fluctuations limit conventional readout. We introduce Quantum Signal Learning (QSL), a sensing framework that extends metrology to a broader property-learning setting, and propose a quantum-enhanced protocol that simultaneously estimates many properties of a classical signal with shot noise suppressed below the vacuum level. Our scheme requires only two-mode squeezing, passive optics, and static homodyne measurements, and enables post-hoc classical estimation of many properties from the same experimental dataset. We prove that our protocol enables a quantum speedup for common classical sensing tasks, including measuring electromagnetic correlations, real-time feedback control of interferometric cavities, and Fourier-domain matched filtering. To establish these separations, we introduce an optimal-transport conditioning method, and show both worst-case exponential separations from all entanglement-free strategies and practical speedups over homodyne and heterodyne baselines. We further show that when squeezing is treated as a resource, a protocol with squeezed light can sense a structured classical background exponentially faster than any coherent classical probe.",
      "pdf": "https://arxiv.org/pdf/2602.17591v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17591v1",
      "abs_url": "https://arxiv.org/abs/2602.17591v1",
      "published": "2026-02-19"
    },
    {
      "title": "Asymptotically Optimal Sequential Testing with Markovian Data",
      "authors": [
        "Alhad Sethi",
        "Kavali Sofia Sagar",
        "Shubhada Agrawal",
        "Debabrota Basu",
        "P. N. Karthik"
      ],
      "abstract": "We study one-sided and $α$-correct sequential hypothesis testing for data generated by an ergodic Markov chain. The null hypothesis is that the unknown transition matrix belongs to a prescribed set $P$ of stochastic matrices, and the alternative corresponds to a disjoint set $Q$. We establish a tight non-asymptotic instance-dependent lower bound on the expected stopping time of any valid sequential test under the alternative. Our novel analysis improves the existing lower bounds, which are either asymptotic or provably sub-optimal in this setting. Our lower bound incorporates both the stationary distribution and the transition structure induced by the unknown Markov chain. We further propose an optimal test whose expected stopping time matches this lower bound asymptotically as $α\\to 0$. We illustrate the usefulness of our framework through applications to sequential detection of model misspecification in Markov Chain Monte Carlo and to testing structural properties, such as the linearity of transition dynamics, in Markov decision processes. Our findings yield a sharp and general characterization of optimal sequential testing procedures under Markovian dependence.",
      "pdf": "https://arxiv.org/pdf/2602.17587v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17587v1",
      "abs_url": "https://arxiv.org/abs/2602.17587v1",
      "published": "2026-02-19"
    },
    {
      "title": "Conditional Flow Matching for Continuous Anomaly Detection in Autonomous Driving on a Manifold-Aware Spectral Space",
      "authors": [
        "Antonio Guillen-Perez"
      ],
      "abstract": "Safety validation for Level 4 autonomous vehicles (AVs) is currently bottlenecked by the inability to scale the detection of rare, high-risk long-tail scenarios using traditional rule-based heuristics. We present Deep-Flow, an unsupervised framework for safety-critical anomaly detection that utilizes Optimal Transport Conditional Flow Matching (OT-CFM) to characterize the continuous probability density of expert human driving behavior. Unlike standard generative approaches that operate in unstable, high-dimensional coordinate spaces, Deep-Flow constrains the generative process to a low-rank spectral manifold via a Principal Component Analysis (PCA) bottleneck. This ensures kinematic smoothness by design and enables the computation of the exact Jacobian trace for numerically stable, deterministic log-likelihood estimation. To resolve multi-modal ambiguity at complex junctions, we utilize an Early Fusion Transformer encoder with lane-aware goal conditioning, featuring a direct skip-connection to the flow head to maintain intent-integrity throughout the network. We introduce a kinematic complexity weighting scheme that prioritizes high-energy maneuvers (quantified via path tortuosity and jerk) during the simulation-free training process. Evaluated on the Waymo Open Motion Dataset (WOMD), our framework achieves an AUC-ROC of 0.766 against a heuristic golden set of safety-critical events. More significantly, our analysis reveals a fundamental distinction between kinematic danger and semantic non-compliance. Deep-Flow identifies a critical predictability gap by surfacing out-of-distribution behaviors, such as lane-boundary violations and non-normative junction maneuvers, that traditional safety filters overlook. This work provides a mathematically rigorous foundation for defining statistical safety gates, enabling objective, data-driven validation for the safe deployment of autonomous fleets.",
      "pdf": "https://arxiv.org/pdf/2602.17586v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17586v1",
      "abs_url": "https://arxiv.org/abs/2602.17586v1",
      "published": "2026-02-19"
    },
    {
      "title": "Canonicalizing Multimodal Contrastive Representation Learning",
      "authors": [
        "Sharut Gupta",
        "Sanyam Kansal",
        "Stefanie Jegelka",
        "Phillip Isola",
        "Vikas Garg"
      ],
      "abstract": "As models and data scale, independently trained networks often induce analogous notions of similarity. But, matching similarities is weaker than establishing an explicit correspondence between the representation spaces, especially for multimodal models, where consistency must hold not only within each modality, but also for the learned image-text coupling. We therefore ask: given two independently trained multimodal contrastive models (with encoders $(f, g)$ and $(\\widetilde{f},\\widetilde{g})$) -- trained on different distributions and with different architectures -- does a systematic geometric relationship exist between their embedding spaces? If so, what form does it take, and does it hold uniformly across modalities? In this work, we show that across model families such as CLIP, SigLIP, and FLAVA, this geometric relationship is well approximated by an orthogonal map (up to a global mean shift), i.e., there exists an orthogonal map $Q$ where $Q^\\top Q = I$ such that $\\widetilde{f}(x)\\approx Q f(x)$ for paired images $x$. Strikingly, the same $Q$ simultaneously aligns the text encoders i.e., $\\widetilde{g}(y)\\approx Q g(y)$ for texts $y$. Theoretically, we prove that if the multimodal kernel agrees across models on a small anchor set i.e. $\\langle f(x), g(y)\\rangle \\approx \\langle \\widetilde{f}(x), \\widetilde{g}(y)\\rangle$, then the two models must be related by a single orthogonal map $Q$ and the same $Q$ maps images and text across models. More broadly, this finding enables backward-compatible model upgrades, avoiding costly re-embedding, and has implications for the privacy of learned representations.\n  Our project page: https://canonical-multimodal.github.io/",
      "pdf": "https://arxiv.org/pdf/2602.17584v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17584v1",
      "abs_url": "https://arxiv.org/abs/2602.17584v1",
      "published": "2026-02-19"
    },
    {
      "title": "Simultaneous Blackwell Approachability and Applications to Multiclass Omniprediction",
      "authors": [
        "Lunjia Hu",
        "Kevin Tian",
        "Chutong Yang"
      ],
      "abstract": "Omniprediction is a learning problem that requires suboptimality bounds for each of a family of losses $\\mathcal{L}$ against a family of comparator predictors $\\mathcal{C}$. We initiate the study of omniprediction in a multiclass setting, where the comparator family $\\mathcal{C}$ may be infinite. Our main result is an extension of the recent binary omniprediction algorithm of [OKK25] to the multiclass setting, with sample complexity (in statistical settings) or regret horizon (in online settings) $\\approx \\varepsilon^{-(k+1)}$, for $\\varepsilon$-omniprediction in a $k$-class prediction problem. En route to proving this result, we design a framework of potential broader interest for solving Blackwell approachability problems where multiple sets must simultaneously be approached via coupled actions.",
      "pdf": "https://arxiv.org/pdf/2602.17577v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17577v1",
      "abs_url": "https://arxiv.org/abs/2602.17577v1",
      "published": "2026-02-19"
    },
    {
      "title": "Be Wary of Your Time Series Preprocessing",
      "authors": [
        "Sofiane Ennadir",
        "Tianze Wang",
        "Oleg Smirnov",
        "Sahar Asadi",
        "Lele Cao"
      ],
      "abstract": "Normalization and scaling are fundamental preprocessing steps in time series modeling, yet their role in Transformer-based models remains underexplored from a theoretical perspective. In this work, we present the first formal analysis of how different normalization strategies, specifically instance-based and global scaling, impact the expressivity of Transformer-based architectures for time series representation learning. We propose a novel expressivity framework tailored to time series, which quantifies a model's ability to distinguish between similar and dissimilar inputs in the representation space. Using this framework, we derive theoretical bounds for two widely used normalization methods: Standard and Min-Max scaling. Our analysis reveals that the choice of normalization strategy can significantly influence the model's representational capacity, depending on the task and data characteristics. We complement our theory with empirical validation on classification and forecasting benchmarks using multiple Transformer-based models. Our results show that no single normalization method consistently outperforms others, and in some cases, omitting normalization entirely leads to superior performance. These findings highlight the critical role of preprocessing in time series learning and motivate the need for more principled normalization strategies tailored to specific tasks and datasets.",
      "pdf": "https://arxiv.org/pdf/2602.17568v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17568v1",
      "abs_url": "https://arxiv.org/abs/2602.17568v1",
      "published": "2026-02-19"
    },
    {
      "title": "A Hybrid Federated Learning Based Ensemble Approach for Lung Disease Diagnosis Leveraging Fusion of SWIN Transformer and CNN",
      "authors": [
        "Asif Hasan Chowdhury",
        "Md. Fahim Islam",
        "M Ragib Anjum Riad",
        "Faiyaz Bin Hashem",
        "Md Tanzim Reza",
        "Md. Golam Rabiul Alam"
      ],
      "abstract": "The significant advancements in computational power cre- ate a vast opportunity for using Artificial Intelligence in different ap- plications of healthcare and medical science. A Hybrid FL-Enabled Ensemble Approach For Lung Disease Diagnosis Leveraging a Combination of SWIN Transformer and CNN is the combination of cutting-edge technology of AI and Federated Learning. Since, medi- cal specialists and hospitals will have shared data space, based on that data, with the help of Artificial Intelligence and integration of federated learning, we can introduce a secure and distributed system for medical data processing and create an efficient and reliable system. The proposed hybrid model enables the detection of COVID-19 and Pneumonia based on x-ray reports. We will use advanced and the latest available tech- nology offered by Tensorflow and Keras along with Microsoft-developed Vision Transformer, that can help to fight against the pandemic that the world has to fight together as a united. We focused on using the latest available CNN models (DenseNet201, Inception V3, VGG 19) and the Transformer model SWIN Transformer in order to prepare our hy- brid model that can provide a reliable solution as a helping hand for the physician in the medical field. In this research, we will discuss how the Federated learning-based Hybrid AI model can improve the accuracy of disease diagnosis and severity prediction of a patient using the real-time continual learning approach and how the integration of federated learn- ing can ensure hybrid model security and keep the authenticity of the information.",
      "pdf": "https://arxiv.org/pdf/2602.17566v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17566v1",
      "abs_url": "https://arxiv.org/abs/2602.17566v1",
      "published": "2026-02-19"
    },
    {
      "title": "Optimal Unconstrained Self-Distillation in Ridge Regression: Strict Improvements, Precise Asymptotics, and One-Shot Tuning",
      "authors": [
        "Hien Dang",
        "Pratik Patil",
        "Alessandro Rinaldo"
      ],
      "abstract": "Self-distillation (SD) is the process of retraining a student on a mixture of ground-truth labels and the teacher's own predictions using the same architecture and training data. Although SD has been empirically shown to often improve generalization, its formal guarantees remain limited. We study SD for ridge regression in unconstrained setting in which the mixing weight $ξ$ may be outside the unit interval. Conditioned on the training data and without any distributional assumptions, we prove that for any squared prediction risk (including out-of-distribution), the optimally mixed student strictly improves upon the ridge teacher for every regularization level $λ> 0$ at which the teacher ridge risk $R(λ)$ is nonstationary (i.e., $R'(λ) \\neq 0$). We obtain a closed-form expression for the optimal mixing weight $ξ^\\star(λ)$ for any value of $λ$ and show that it obeys the sign rule: $\\operatorname{sign}(ξ^\\star(λ))=-\\operatorname{sign}(R'(λ))$. In particular, $ξ^\\star(λ)$ can be negative, which is the case in over-regularized regimes. To quantify the risk improvement due to SD, we derive exact deterministic equivalents for the optimal SD risk in the proportional asymptotics regime (where the sample and feature sizes $n$ and $p$ both diverge but their aspect ratio $p/n$ converges) under general anisotropic covariance and deterministic signals. Our asymptotic analysis extends standard second-order ridge deterministic equivalents to their fourth-order analogs using block linearization, which may be of independent interest. From a practical standpoint, we propose a consistent one-shot tuning method to estimate $ξ^\\star$ without grid search, sample splitting, or refitting. Experiments on real-world datasets and pretrained neural network features support our theory and the one-shot tuning method.",
      "pdf": "https://arxiv.org/pdf/2602.17565v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17565v1",
      "abs_url": "https://arxiv.org/abs/2602.17565v1",
      "published": "2026-02-19"
    },
    {
      "title": "Compact Representation of Particle-Collision Events for Physics-Informed Machine Learning",
      "authors": [
        "Wasikul Islam",
        "Sergei Chekanov"
      ],
      "abstract": "We introduce a compact, physics-driven event representation, RMM-C46, designed to compress the high-dimensional rapidity mass matrix (RMM) into a low-dimensional, interpretable feature set suitable for physics-informed machine learning (ML) and quantum computing applications. The full RMM encodes detailed pairwise correlations among jets, b-jets, leptons, photons, and missing transverse energy but contains more than a thousand values per event, making it computationally heavy for large-scale training and incompatible with current low-qubit quantum devices. The proposed RMM-C46 input space for ML preserves the physical block structure of the RMM through aggregated invariant mass, rapidity difference, and transverse energy components, reducing the size of the original RMM by over an order of magnitude while maintaining interpretability. Applied to simulated proton-proton collisions at centre-of-mass energy of 13.6 TeV, these representations match or exceed the discriminative performance of the full RMM in both supervised and unsupervised ML tasks. Their compactness, stability, and physics transparency also make them naturally compatible with near-term quantum machine learning architectures. RMM-C46 provides a scalable, efficient, and quantum-ready alternative to the full RMM for next-generation collider physics analyses.",
      "pdf": "https://arxiv.org/pdf/2602.17563v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17563v1",
      "abs_url": "https://arxiv.org/abs/2602.17563v1",
      "published": "2026-02-19"
    },
    {
      "title": "Revisiting Weight Regularization for Low-Rank Continual Learning",
      "authors": [
        "Yaoyue Zheng",
        "Yin Zhang",
        "Joost van de Weijer",
        "Gido M van de Ven",
        "Shaoyi Du",
        "Xuetao Zhang",
        "Zhiqiang Tian"
      ],
      "abstract": "Continual Learning (CL) with large-scale pre-trained models (PTMs) has recently gained wide attention, shifting the focus from training from scratch to continually adapting PTMs. This has given rise to a promising paradigm: parameter-efficient continual learning (PECL), where task interference is typically mitigated by assigning a task-specific module during training, such as low-rank adapters. However, weight regularization techniques, such as Elastic Weight Consolidation (EWC)-a key strategy in CL-remain underexplored in this new paradigm. In this paper, we revisit weight regularization in low-rank CL as a new perspective for mitigating task interference in PECL. Unlike existing low-rank CL methods, we mitigate task interference by regularizing a shared low-rank update through EWC, thereby keeping the storage requirement and inference costs constant regardless of the number of tasks. Our proposed method EWC-LoRA leverages a low-rank representation to estimate parameter importance over the full-dimensional space. This design offers a practical, computational- and memory-efficient solution for CL with PTMs, and provides insights that may inform the broader application of regularization techniques within PECL. Extensive experiments on various benchmarks demonstrate the effectiveness of EWC-LoRA, achieving a stability-plasticity trade-off superior to existing low-rank CL approaches. These results indicate that, even under low-rank parameterizations, weight regularization remains an effective mechanism for mitigating task interference. Code is available at: https://github.com/yaoyz96/low-rank-cl.",
      "pdf": "https://arxiv.org/pdf/2602.17559v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17559v1",
      "abs_url": "https://arxiv.org/abs/2602.17559v1",
      "published": "2026-02-19"
    },
    {
      "title": "RetouchIQ: MLLM Agents for Instruction-Based Image Retouching with Generalist Reward",
      "authors": [
        "Qiucheng Wu",
        "Jing Shi",
        "Simon Jenni",
        "Kushal Kafle",
        "Tianyu Wang",
        "Shiyu Chang",
        "Handong Zhao"
      ],
      "abstract": "Recent advances in multimodal large language models (MLLMs) have shown great potential for extending vision-language reasoning to professional tool-based image editing, enabling intuitive and creative editing. A promising direction is to use reinforcement learning (RL) to enable MLLMs to reason about and execute optimal tool-use plans within professional image-editing software. However, training remains challenging due to the lack of reliable, verifiable reward signals that can reflect the inherently subjective nature of creative editing. In this work, we introduce RetouchIQ, a framework that performs instruction-based executable image editing through MLLM agents guided by a generalist reward model. RetouchIQ interprets user-specified editing intentions and generates corresponding, executable image adjustments, bridging high-level aesthetic goals with precise parameter control. To move beyond conventional, rule-based rewards that compute similarity against a fixed reference image using handcrafted metrics, we propose a generalist reward model, an RL fine-tuned MLLM that evaluates edited results through a set of generated metrics on a case-by-case basis. Then, the reward model provides scalar feedback through multimodal reasoning, enabling reinforcement learning with high-quality, instruction-consistent gradients. We curate an extended dataset with 190k instruction-reasoning pairs and establish a new benchmark for instruction-based image editing. Experiments show that RetouchIQ substantially improves both semantic consistency and perceptual quality over previous MLLM-based and diffusion-based editing systems. Our findings demonstrate the potential of generalist reward-driven MLLM agents as flexible, explainable, and executable assistants for professional image editing.",
      "pdf": "https://arxiv.org/pdf/2602.17558v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17558v1",
      "abs_url": "https://arxiv.org/abs/2602.17558v1",
      "published": "2026-02-19"
    },
    {
      "title": "Probability-Invariant Random Walk Learning on Gyral Folding-Based Cortical Similarity Networks for Alzheimer's and Lewy Body Dementia Diagnosis",
      "authors": [
        "Minheng Chen",
        "Jing Zhang",
        "Tong Chen",
        "Chao Cao",
        "Tianming Liu",
        "Li Su",
        "Dajiang Zhu"
      ],
      "abstract": "Alzheimer's disease (AD) and Lewy body dementia (LBD) present overlapping clinical features yet require distinct diagnostic strategies. While neuroimaging-based brain network analysis is promising, atlas-based representations may obscure individualized anatomy. Gyral folding-based networks using three-hinge gyri provide a biologically grounded alternative, but inter-individual variability in cortical folding results in inconsistent landmark correspondence and highly irregular network sizes, violating the fixed-topology and node-alignment assumptions of most existing graph learning methods, particularly in clinical datasets where pathological changes further amplify anatomical heterogeneity. We therefore propose a probability-invariant random-walk-based framework that classifies individualized gyral folding networks without explicit node alignment. Cortical similarity networks are built from local morphometric features and represented by distributions of anonymized random walks, with an anatomy-aware encoding that preserves permutation invariance. Experiments on a large clinical cohort of AD and LBD subjects show consistent improvements over existing gyral folding and atlas-based models, demonstrating robustness and potential for dementia diagnosis.",
      "pdf": "https://arxiv.org/pdf/2602.17557v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17557v1",
      "abs_url": "https://arxiv.org/abs/2602.17557v1",
      "published": "2026-02-19"
    },
    {
      "title": "Neural Implicit Representations for 3D Synthetic Aperture Radar Imaging",
      "authors": [
        "Nithin Sugavanam",
        "Emre Ertin"
      ],
      "abstract": "Synthetic aperture radar (SAR) is a tomographic sensor that measures 2D slices of the 3D spatial Fourier transform of the scene. In many operational scenarios, the measured set of 2D slices does not fill the 3D space in the Fourier domain, resulting in significant artifacts in the reconstructed imagery. Traditionally, simple priors, such as sparsity in the image domain, are used to regularize the inverse problem. In this paper, we review our recent work that achieves state-of-the-art results in 3D SAR imaging employing neural structures to model the surface scattering that dominates SAR returns. These neural structures encode the surface of the objects in the form of a signed distance function learned from the sparse scattering data. Since estimating a smooth surface from a sparse and noisy point cloud is an ill-posed problem, we regularize the surface estimation by sampling points from the implicit surface representation during the training step. We demonstrate the model's ability to represent target scattering using measured and simulated data from single vehicles and a larger scene with a large number of vehicles. We conclude with future research directions calling for methods to learn complex-valued neural representations to enable synthesizing new collections from the volumetric neural implicit representation.",
      "pdf": "https://arxiv.org/pdf/2602.17556v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17556v1",
      "abs_url": "https://arxiv.org/abs/2602.17556v1",
      "published": "2026-02-19"
    },
    {
      "title": "A Theoretical Framework for Modular Learning of Robust Generative Models",
      "authors": [
        "Corinna Cortes",
        "Mehryar Mohri",
        "Yutao Zhong"
      ],
      "abstract": "Training large-scale generative models is resource-intensive and relies heavily on heuristic dataset weighting. We address two fundamental questions: Can we train Large Language Models (LLMs) modularly-combining small, domain-specific experts to match monolithic performance-and can we do so robustly for any data mixture, eliminating heuristic tuning? We present a theoretical framework for modular generative modeling where a set of pre-trained experts are combined via a gating mechanism. We define the space of normalized gating functions, $G_{1}$, and formulate the problem as a minimax game to find a single robust gate that minimizes divergence to the worst-case data mixture. We prove the existence of such a robust gate using Kakutani's fixed-point theorem and show that modularity acts as a strong regularizer, with generalization bounds scaling with the lightweight gate's complexity. Furthermore, we prove that this modular approach can theoretically outperform models retrained on aggregate data, with the gap characterized by the Jensen-Shannon Divergence. Finally, we introduce a scalable Stochastic Primal-Dual algorithm and a Structural Distillation method for efficient inference. Empirical results on synthetic and real-world datasets confirm that our modular architecture effectively mitigates gradient conflict and can robustly outperform monolithic baselines.",
      "pdf": "https://arxiv.org/pdf/2602.17554v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17554v1",
      "abs_url": "https://arxiv.org/abs/2602.17554v1",
      "published": "2026-02-19"
    },
    {
      "title": "MASPO: Unifying Gradient Utilization, Probability Mass, and Signal Reliability for Robust and Sample-Efficient LLM Reasoning",
      "authors": [
        "Xiaoliang Fu",
        "Jiaye Lin",
        "Yangyi Fang",
        "Binbin Zheng",
        "Chaowen Hu",
        "Zekai Shao",
        "Cong Qin",
        "Lu Pan",
        "Ke Zeng",
        "Xunliang Cai"
      ],
      "abstract": "Existing Reinforcement Learning with Verifiable Rewards (RLVR) algorithms, such as GRPO, rely on rigid, uniform, and symmetric trust region mechanisms that are fundamentally misaligned with the complex optimization dynamics of Large Language Models (LLMs). In this paper, we identify three critical challenges in these methods: (1) inefficient gradient utilization caused by the binary cutoff of hard clipping, (2) insensitive probability mass arising from uniform ratio constraints that ignore the token distribution, and (3) asymmetric signal reliability stemming from the disparate credit assignment ambiguity between positive and negative samples. To bridge these gaps, we propose Mass-Adaptive Soft Policy Optimization (MASPO), a unified framework designed to harmonize these three dimensions. MASPO integrates a differentiable soft Gaussian gating to maximize gradient utility, a mass-adaptive limiter to balance exploration across the probability spectrum, and an asymmetric risk controller to align update magnitudes with signal confidence. Extensive evaluations demonstrate that MASPO serves as a robust, all-in-one RLVR solution, significantly outperforming strong baselines. Our code is available at: https://anonymous.4open.science/r/ma1/README.md.",
      "pdf": "https://arxiv.org/pdf/2602.17550v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17550v1",
      "abs_url": "https://arxiv.org/abs/2602.17550v1",
      "published": "2026-02-19"
    },
    {
      "title": "Learning to Stay Safe: Adaptive Regularization Against Safety Degradation during Fine-Tuning",
      "authors": [
        "Jyotin Goel",
        "Souvik Maji",
        "Pratik Mazumder"
      ],
      "abstract": "Instruction-following language models are trained to be helpful and safe, yet their safety behavior can deteriorate under benign fine-tuning and worsen under adversarial updates. Existing defenses often offer limited protection or force a trade-off between safety and utility. We introduce a training framework that adapts regularization in response to safety risk, enabling models to remain aligned throughout fine-tuning. To estimate safety risk at training time, we explore two distinct approaches: a judge-based Safety Critic that assigns high-level harm scores to training batches, and an activation-based risk predictor built with a lightweight classifier trained on intermediate model activations to estimate harmful intent. Each approach provides a risk signal that is used to constrain updates deemed higher risk to remain close to a safe reference policy, while lower-risk updates proceed with standard training. We empirically verify that harmful intent signals are predictable from pre-generation activations and that judge scores provide effective high-recall safety guidance. Across multiple model families and attack scenarios, adaptive regularization with either risk estimation approach consistently lowers attack success rate compared to standard fine-tuning, preserves downstream performance, and adds no inference-time cost. This work demonstrates a principled mechanism for maintaining safety without sacrificing utility.",
      "pdf": "https://arxiv.org/pdf/2602.17546v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17546v1",
      "abs_url": "https://arxiv.org/abs/2602.17546v1",
      "published": "2026-02-19"
    },
    {
      "title": "Adaptive Decentralized Composite Optimization via Three-Operator Splitting",
      "authors": [
        "Xiaokai Chen",
        "Ilya Kuruzov",
        "Gesualdo Scutari"
      ],
      "abstract": "The paper studies decentralized optimization over networks, where agents minimize a sum of {\\it locally} smooth (strongly) convex losses and plus a nonsmooth convex extended value term. We propose decentralized methods wherein agents {\\it adaptively} adjust their stepsize via local backtracking procedures coupled with lightweight min-consensus protocols. Our design stems from a three-operator splitting factorization applied to an equivalent reformulation of the problem. The reformulation is endowed with a new BCV preconditioning metric (Bertsekas-O'Connor-Vandenberghe), which enables efficient decentralized implementation and local stepsize adjustments. We establish robust convergence guarantees. Under mere convexity, the proposed methods converge with a sublinear rate. Under strong convexity of the sum-function, and assuming the nonsmooth component is partly smooth, we further prove linear convergence. Numerical experiments corroborate the theory and highlight the effectiveness of the proposed adaptive stepsize strategy.",
      "pdf": "https://arxiv.org/pdf/2602.17545v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17545v1",
      "abs_url": "https://arxiv.org/abs/2602.17545v1",
      "published": "2026-02-19"
    },
    {
      "title": "genriesz: A Python Package for Automatic Debiased Machine Learning with Generalized Riesz Regression",
      "authors": [
        "Masahiro Kato"
      ],
      "abstract": "Efficient estimation of causal and structural parameters can be automated using the Riesz representation theorem and debiased machine learning (DML). We present genriesz, an open-source Python package that implements automatic DML and generalized Riesz regression, a unified framework for estimating Riesz representers by minimizing empirical Bregman divergences. This framework includes covariate balancing, nearest-neighbor matching, calibrated estimation, and density ratio estimation as special cases. A key design principle of the package is automatic regressor balancing (ARB): given a Bregman generator $g$ and a representer model class, genriesz} automatically constructs a compatible link function so that the generalized Riesz regression estimator satisfies balancing (moment-matching) optimality conditions in a user-chosen basis. The package provides a modulr interface for specifying (i) the target linear functional via a black-box evaluation oracle, (ii) the representer model via basis functions (polynomial, RKHS approximations, random forest leaf encodings, neural embeddings, and a nearest-neighbor catchment basis), and (iii) the Bregman generator, with optional user-supplied derivatives. It returns regression adjustment (RA), Riesz weighting (RW), augmented Riesz weighting (ARW), and TMLE-style estimators with cross-fitting, confidence intervals, and $p$-values. We highlight representative workflows for estimation problems such as the average treatment effect (ATE), ATE on treated (ATT), and average marginal effect estimation. The Python package is available at https://github.com/MasaKat0/genriesz and on PyPI.",
      "pdf": "https://arxiv.org/pdf/2602.17543v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17543v1",
      "abs_url": "https://arxiv.org/abs/2602.17543v1",
      "published": "2026-02-19"
    },
    {
      "title": "Using LLMs for Knowledge Component-level Correctness Labeling in Open-ended Coding Problems",
      "authors": [
        "Zhangqi Duan",
        "Arnav Kankaria",
        "Dhruv Kartik",
        "Andrew Lan"
      ],
      "abstract": "Fine-grained skill representations, commonly referred to as knowledge components (KCs), are fundamental to many approaches in student modeling and learning analytics. However, KC-level correctness labels are rarely available in real-world datasets, especially for open-ended programming tasks where solutions typically involve multiple KCs simultaneously. Simply propagating problem-level correctness to all associated KCs obscures partial mastery and often leads to poorly fitted learning curves. To address this challenge, we propose an automated framework that leverages large language models (LLMs) to label KC-level correctness directly from student-written code. Our method assesses whether each KC is correctly applied and further introduces a temporal context-aware Code-KC mapping mechanism to better align KCs with individual student code. We evaluate the resulting KC-level correctness labels in terms of learning curve fit and predictive performance using the power law of practice and the Additive Factors Model. Experimental results show that our framework leads to learning curves that are more consistent with cognitive theory and improves predictive performance, compared to baselines. Human evaluation further demonstrates substantial agreement between LLM and expert annotations.",
      "pdf": "https://arxiv.org/pdf/2602.17542v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17542v1",
      "abs_url": "https://arxiv.org/abs/2602.17542v1",
      "published": "2026-02-19"
    },
    {
      "title": "IRIS: Learning-Driven Task-Specific Cinema Robot Arm for Visuomotor Motion Control",
      "authors": [
        "Qilong Cheng",
        "Matthew Mackay",
        "Ali Bereyhi"
      ],
      "abstract": "Robotic camera systems enable dynamic, repeatable motion beyond human capabilities, yet their adoption remains limited by the high cost and operational complexity of industrial-grade platforms. We present the Intelligent Robotic Imaging System (IRIS), a task-specific 6-DOF manipulator designed for autonomous, learning-driven cinematic motion control. IRIS integrates a lightweight, fully 3D-printed hardware design with a goal-conditioned visuomotor imitation learning framework based on Action Chunking with Transformers (ACT). The system learns object-aware and perceptually smooth camera trajectories directly from human demonstrations, eliminating the need for explicit geometric programming. The complete platform costs under $1,000 USD, supports a 1.5 kg payload, and achieves approximately 1 mm repeatability. Real-world experiments demonstrate accurate trajectory tracking, reliable autonomous execution, and generalization across diverse cinematic motions.",
      "pdf": "https://arxiv.org/pdf/2602.17537v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17537v1",
      "abs_url": "https://arxiv.org/abs/2602.17537v1",
      "published": "2026-02-19"
    },
    {
      "title": "Toward a Fully Autonomous, AI-Native Particle Accelerator",
      "authors": [
        "Chris Tennant"
      ],
      "abstract": "This position paper presents a vision for self-driving particle accelerators that operate autonomously with minimal human intervention. We propose that future facilities be designed through artificial intelligence (AI) co-design, where AI jointly optimizes the accelerator lattice, diagnostics, and science application from inception to maximize performance while enabling autonomous operation. Rather than retrofitting AI onto human-centric systems, we envision facilities designed from the ground up as AI-native platforms. We outline nine critical research thrusts spanning agentic control architectures, knowledge integration, adaptive learning, digital twins, health monitoring, safety frameworks, modular hardware design, multimodal data fusion, and cross-domain collaboration. This roadmap aims to guide the accelerator community toward a future where AI-driven design and operation deliver unprecedented science output and reliability.",
      "pdf": "https://arxiv.org/pdf/2602.17536v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17536v1",
      "abs_url": "https://arxiv.org/abs/2602.17536v1",
      "published": "2026-02-19"
    },
    {
      "title": "Position: Evaluation of ECG Representations Must Be Fixed",
      "authors": [
        "Zachary Berger",
        "Daniel Prakah-Asante",
        "John Guttag",
        "Collin M. Stultz"
      ],
      "abstract": "This position paper argues that current benchmarking practice in 12-lead ECG representation learning must be fixed to ensure progress is reliable and aligned with clinically meaningful objectives. The field has largely converged on three public multi-label benchmarks (PTB-XL, CPSC2018, CSN) dominated by arrhythmia and waveform-morphology labels, even though the ECG is known to encode substantially broader clinical information. We argue that downstream evaluation should expand to include an assessment of structural heart disease and patient-level forecasting, in addition to other evolving ECG-related endpoints, as relevant clinical targets. Next, we outline evaluation best practices for multi-label, imbalanced settings, and show that when they are applied, the literature's current conclusion about which representations perform best is altered. Furthermore, we demonstrate the surprising result that a randomly initialized encoder with linear evaluation matches state-of-the-art pre-training on many tasks. This motivates the use of a random encoder as a reasonable baseline model. We substantiate our observations with an empirical evaluation of three representative ECG pre-training approaches across six evaluation settings: the three standard benchmarks, a structural disease dataset, hemodynamic inference, and patient forecasting.",
      "pdf": "https://arxiv.org/pdf/2602.17531v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17531v1",
      "abs_url": "https://arxiv.org/abs/2602.17531v1",
      "published": "2026-02-19"
    },
    {
      "title": "Provably Explaining Neural Additive Models",
      "authors": [
        "Shahaf Bassan",
        "Yizhak Yisrael Elboher",
        "Tobias Ladner",
        "Volkan Şahin",
        "Jan Kretinsky",
        "Matthias Althoff",
        "Guy Katz"
      ],
      "abstract": "Despite significant progress in post-hoc explanation methods for neural networks, many remain heuristic and lack provable guarantees. A key approach for obtaining explanations with provable guarantees is by identifying a cardinally-minimal subset of input features which by itself is provably sufficient to determine the prediction. However, for standard neural networks, this task is often computationally infeasible, as it demands a worst-case exponential number of verification queries in the number of input features, each of which is NP-hard.\n  In this work, we show that for Neural Additive Models (NAMs), a recent and more interpretable neural network family, we can efficiently generate explanations with such guarantees. We present a new model-specific algorithm for NAMs that generates provably cardinally-minimal explanations using only a logarithmic number of verification queries\n  in the number of input features, after a parallelized preprocessing step with logarithmic runtime in the required precision is applied to each small univariate NAM component.\n  Our algorithm not only makes the task of obtaining cardinally-minimal explanations feasible, but even outperforms existing algorithms designed to find the relaxed variant of subset-minimal explanations - which may be larger and less informative but easier to compute - despite our algorithm solving a much more difficult task.\n  Our experiments demonstrate that, compared to previous algorithms, our approach provides provably smaller explanations than existing works and substantially reduces the computation time. Moreover, we show that our generated provable explanations offer benefits that are unattainable by standard sampling-based techniques typically used to interpret NAMs.",
      "pdf": "https://arxiv.org/pdf/2602.17530v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17530v1",
      "abs_url": "https://arxiv.org/abs/2602.17530v1",
      "published": "2026-02-19"
    },
    {
      "title": "Interpretable Machine Learning of Nanoparticle Stability through Topological Layer Embeddings",
      "authors": [
        "Felipe Hawthorne",
        "Leandro Seixas",
        "James M. Almeida",
        "Cristiano F. Woellner",
        "Raphael M. Tromer"
      ],
      "abstract": "The stability of chemically complex nanoparticles is governed by an immense configurational space arising from heterogeneous local atomic environments across surface and interior regions. Efficiently identifying low-energy configurations within this space remains a central challenge for first-principles-based materials discovery, particularly when the available reference data are limited. Here, we introduce a data-efficient and physically interpretable machine-learning framework based on a fragmented, layer-resolved descriptor that explicitly decomposes nanoparticles into surface, intermediate, and core environments using a topology-driven definition. This representation preserves a compact and fixed feature dimensionality while retaining spatial resolution, enabling controlled emphasis on different regions of the nanoparticle through physically motivated weighting schemes. Coupled with gradient-boosted decision tree models and a ranking-based learning strategy, the proposed framework enables accurate identification of the most stable nanoparticle configurations using only a few hundred density functional theory reference calculations. Ranking performance metrics demonstrate near-saturation of correlation, high top-k recall, and rapidly vanishing regret at moderate training-set sizes, highlighting the strong data efficiency of the approach. Beyond predictive performance, layer-weighting and SHAP-based interpretability analyses reveal how surface segregation, coordination topology, and local chemical disorder contribute differently to stability across spatial regions of the nanoparticle. These insights provide a transparent physical interpretation of the learned models and establish a natural pathway toward active learning-driven exploration of complex nanoparticle configurational spaces.",
      "pdf": "https://arxiv.org/pdf/2602.17528v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17528v1",
      "abs_url": "https://arxiv.org/abs/2602.17528v1",
      "published": "2026-02-19"
    },
    {
      "title": "The Anxiety of Influence: Bloom Filters in Transformer Attention Heads",
      "authors": [
        "Peter Balogh"
      ],
      "abstract": "Some transformer attention heads appear to function as membership testers, dedicating themselves to answering the question \"has this token appeared before in the context?\" We identify these heads across four language models (GPT-2 small, medium, and large; Pythia-160M) and show that they form a spectrum of membership-testing strategies. Two heads (L0H1 and L0H5 in GPT-2 small) function as high-precision membership filters with false positive rates of 0-4\\% even at 180 unique context tokens -- well above the $d_\\text{head} = 64$ bit capacity of a classical Bloom filter. A third head (L1H11) shows the classic Bloom filter capacity curve: its false positive rate follows the theoretical formula $p \\approx (1 - e^{-kn/m})^k$ with $R^2 = 1.0$ and fitted capacity $m \\approx 5$ bits, saturating by $n \\approx 20$ unique tokens. A fourth head initially identified as a Bloom filter (L3H0) was reclassified as a general prefix-attention head after confound controls revealed its apparent capacity curve was a sequence-length artifact. Together, the three genuine membership-testing heads form a multi-resolution system concentrated in early layers (0-1), taxonomically distinct from induction and previous-token heads, with false positive rates that decay monotonically with embedding distance -- consistent with distance-sensitive Bloom filters. These heads generalize broadly: they respond to any repeated token type, not just repeated names, with 43\\% higher generalization than duplicate-token-only heads. Ablation reveals these heads contribute to both repeated and novel token processing, indicating that membership testing coexists with broader computational roles. The reclassification of L3H0 through confound controls strengthens rather than weakens the case: the surviving heads withstand the scrutiny that eliminated a false positive in our own analysis.",
      "pdf": "https://arxiv.org/pdf/2602.17526v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17526v1",
      "abs_url": "https://arxiv.org/abs/2602.17526v1",
      "published": "2026-02-19"
    },
    {
      "title": "Variational inference via radial transport",
      "authors": [
        "Luca Ghafourpour",
        "Sinho Chewi",
        "Alessio Figalli",
        "Aram-Alexandre Pooladian"
      ],
      "abstract": "In variational inference (VI), the practitioner approximates a high-dimensional distribution $π$ with a simple surrogate one, often a (product) Gaussian distribution. However, in many cases of practical interest, Gaussian distributions might not capture the correct radial profile of $π$, resulting in poor coverage. In this work, we approach the VI problem from the perspective of optimizing over these radial profiles. Our algorithm radVI is a cheap, effective add-on to many existing VI schemes, such as Gaussian (mean-field) VI and Laplace approximation. We provide theoretical convergence guarantees for our algorithm, owing to recent developments in optimization over the Wasserstein space--the space of probability distributions endowed with the Wasserstein distance--and new regularity properties of radial transport maps in the style of Caffarelli (2000).",
      "pdf": "https://arxiv.org/pdf/2602.17525v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17525v1",
      "abs_url": "https://arxiv.org/abs/2602.17525v1",
      "published": "2026-02-19"
    },
    {
      "title": "When Models Ignore Definitions: Measuring Semantic Override Hallucinations in LLM Reasoning",
      "authors": [
        "Yogeswar Reddy Thota",
        "Setareh Rafatirad",
        "Homayoun Houman",
        "Tooraj Nikoubin"
      ],
      "abstract": "Large language models (LLMs) demonstrate strong performance on standard digital logic and Boolean reasoning tasks, yet their reliability under locally redefined semantics remains poorly understood. In many formal settings, such as circuit specifications, examinations, and hardware documentation, operators and components are explicitly redefined within narrow scope. Correct reasoning in these contexts requires models to temporarily suppress globally learned conventions in favor of prompt-local definitions. In this work, we study a systematic failure mode we term semantic override, in which an LLM reverts to its pretrained default interpretation of operators or gate behavior despite explicit redefinition in the prompt. We also identify a related class of errors, assumption injection, where models commit to unstated hardware semantics when critical details are underspecified, rather than requesting clarification. We introduce a compact micro-benchmark of 30 logic and digital-circuit reasoning tasks designed as verifier-style traps, spanning Boolean algebra, operator overloading, redefined gates, and circuit-level semantics. Evaluating three frontier LLMs, we observe persistent noncompliance with local specifications, confident but incompatible assumptions, and dropped constraints even in elementary settings. Our findings highlight a gap between surface-level correctness and specification-faithful reasoning, motivating evaluation protocols that explicitly test local unlearning and semantic compliance in formal domains.",
      "pdf": "https://arxiv.org/pdf/2602.17520v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17520v1",
      "abs_url": "https://arxiv.org/abs/2602.17520v1",
      "published": "2026-02-19"
    },
    {
      "title": "FoundationPose-Initialized 3D-2D Liver Registration for Surgical Augmented Reality",
      "authors": [
        "Hanyuan Zhang",
        "Lucas He",
        "Runlong He",
        "Abdolrahim Kadkhodamohammadi",
        "Danail Stoyanov",
        "Brian R. Davidson",
        "Evangelos B. Mazomenos",
        "Matthew J. Clarkson"
      ],
      "abstract": "Augmented reality can improve tumor localization in laparoscopic liver surgery. Existing registration pipelines typically depend on organ contours; deformable (non-rigid) alignment is often handled with finite-element (FE) models coupled to dimensionality-reduction or machine-learning components. We integrate laparoscopic depth maps with a foundation pose estimator for camera-liver pose estimation and replace FE-based deformation with non-rigid iterative closest point (NICP) to lower engineering/modeling complexity and expertise requirements. On real patient data, the depth-augmented foundation pose approach achieved 9.91 mm mean registration error in 3 cases. Combined rigid-NICP registration outperformed rigid-only registration, demonstrating NICP as an efficient substitute for finite-element deformable models. This pipeline achieves clinically relevant accuracy while offering a lightweight, engineering-friendly alternative to FE-based deformation.",
      "pdf": "https://arxiv.org/pdf/2602.17517v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17517v1",
      "abs_url": "https://arxiv.org/abs/2602.17517v1",
      "published": "2026-02-19"
    },
    {
      "title": "LORA-CRAFT: Cross-layer Rank Adaptation via Frozen Tucker Decomposition of Pre-trained Attention Weights",
      "authors": [
        "Kasun Dewage",
        "Marianna Pensky",
        "Suranadi De Silva",
        "Shankadeep Mondal"
      ],
      "abstract": "We introduce CRAFT (Cross-layer Rank Adaptation via Frozen Tucker), a parameter-efficient fine-tuning (PEFT) method that applies Tucker tensor decomposition to pre-trained attention weight matrices stacked across transformer layers and trains only small square adaptation matrices on the resulting frozen Tucker factors. Existing tensor-based PEFT methods decompose gradient updates: LoTR applies Tucker decomposition with shared factor matrices, while SuperLoRA groups and reshapes $ΔW$ across layers before applying Tucker decomposition. Separately, methods like PiSSA apply SVD to pre-trained weights but operate independently per layer. CRAFT bridges these two lines of work: it performs full Tucker decomposition via Higher-Order SVD (HOSVD) directly on pre-trained weights organized as cross-layer 3D tensors, freezes all resulting factors, and adapts the model through lightweight trainable transformations applied to each factor matrix. Experiments on the GLUE benchmark using RoBERTa-base and RoBERTa-large demonstrate that CRAFT achieves competitive performance with existing methods while requiring only 41K Tucker adaptation parameters--a count independent of model dimension and depth at fixed Tucker ranks.",
      "pdf": "https://arxiv.org/pdf/2602.17510v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17510v1",
      "abs_url": "https://arxiv.org/abs/2602.17510v1",
      "published": "2026-02-19"
    },
    {
      "title": "Retrospective In-Context Learning for Temporal Credit Assignment with Large Language Models",
      "authors": [
        "Wen-Tse Chen",
        "Jiayu Chen",
        "Fahim Tajwar",
        "Hao Zhu",
        "Xintong Duan",
        "Ruslan Salakhutdinov",
        "Jeff Schneider"
      ],
      "abstract": "Learning from self-sampled data and sparse environmental feedback remains a fundamental challenge in training self-evolving agents. Temporal credit assignment mitigates this issue by transforming sparse feedback into dense supervision signals. However, previous approaches typically depend on learning task-specific value functions for credit assignment, which suffer from poor sample efficiency and limited generalization. In this work, we propose to leverage pretrained knowledge from large language models (LLMs) to transform sparse rewards into dense training signals (i.e., the advantage function) through retrospective in-context learning (RICL). We further propose an online learning framework, RICOL, which iteratively refines the policy based on the credit assignment results from RICL. We empirically demonstrate that RICL can accurately estimate the advantage function with limited samples and effectively identify critical states in the environment for temporal credit assignment. Extended evaluation on four BabyAI scenarios show that RICOL achieves comparable convergent performance with traditional online RL algorithms with significantly higher sample efficiency. Our findings highlight the potential of leveraging LLMs for temporal credit assignment, paving the way for more sample-efficient and generalizable RL paradigms.",
      "pdf": "https://arxiv.org/pdf/2602.17497v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17497v1",
      "abs_url": "https://arxiv.org/abs/2602.17497v1",
      "published": "2026-02-19"
    },
    {
      "title": "Learning with Boolean threshold functions",
      "authors": [
        "Veit Elser",
        "Manish Krishan Lal"
      ],
      "abstract": "We develop a method for training neural networks on Boolean data in which the values at all nodes are strictly $\\pm 1$, and the resulting models are typically equivalent to networks whose nonzero weights are also $\\pm 1$. The method replaces loss minimization with a nonconvex constraint formulation. Each node implements a Boolean threshold function (BTF), and training is expressed through a divide-and-concur decomposition into two complementary constraints: one enforces local BTF consistency between inputs, weights, and output; the other imposes architectural concurrence, equating neuron outputs with downstream inputs and enforcing weight equality across training-data instantiations of the network. The reflect-reflect-relax (RRR) projection algorithm is used to reconcile these constraints.\n  Each BTF constraint includes a lower bound on the margin. When this bound is sufficiently large, the learned representations are provably sparse and equivalent to networks composed of simple logical gates with $\\pm 1$ weights. Across a range of tasks -- including multiplier-circuit discovery, binary autoencoding, logic-network inference, and cellular automata learning -- the method achieves exact solutions or strong generalization in regimes where standard gradient-based methods struggle. These results demonstrate that projection-based constraint satisfaction provides a viable and conceptually distinct foundation for learning in discrete neural systems, with implications for interpretability and efficient inference.",
      "pdf": "https://arxiv.org/pdf/2602.17493v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17493v1",
      "abs_url": "https://arxiv.org/abs/2602.17493v1",
      "published": "2026-02-19"
    },
    {
      "title": "Linear Convergence in Games with Delayed Feedback via Extra Prediction",
      "authors": [
        "Yuma Fujimoto",
        "Kenshi Abe",
        "Kaito Ariu"
      ],
      "abstract": "Feedback delays are inevitable in real-world multi-agent learning. They are known to severely degrade performance, and the convergence rate under delayed feedback is still unclear, even for bilinear games. This paper derives the rate of linear convergence of Weighted Optimistic Gradient Descent-Ascent (WOGDA), which predicts future rewards with extra optimism, in unconstrained bilinear games. To analyze the algorithm, we interpret it as an approximation of the Extra Proximal Point (EPP), which is updated based on farther future rewards than the classical Proximal Point (PP). Our theorems show that standard optimism (predicting the next-step reward) achieves linear convergence to the equilibrium at a rate $\\exp(-Θ(t/m^{5}))$ after $t$ iterations for delay $m$. Moreover, employing extra optimism (predicting farther future reward) tolerates a larger step size and significantly accelerates the rate to $\\exp(-Θ(t/(m^{2}\\log m)))$. Our experiments also show accelerated convergence driven by the extra optimism and are qualitatively consistent with our theorems. In summary, this paper validates that extra optimism is a promising countermeasure against performance degradation caused by feedback delays.",
      "pdf": "https://arxiv.org/pdf/2602.17486v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17486v1",
      "abs_url": "https://arxiv.org/abs/2602.17486v1",
      "published": "2026-02-19"
    },
    {
      "title": "Tracing Copied Pixels and Regularizing Patch Affinity in Copy Detection",
      "authors": [
        "Yichen Lu",
        "Siwei Nie",
        "Minlong Lu",
        "Xudong Yang",
        "Xiaobo Zhang",
        "Peng Zhang"
      ],
      "abstract": "Image Copy Detection (ICD) aims to identify manipulated content between image pairs through robust feature representation learning. While self-supervised learning (SSL) has advanced ICD systems, existing view-level contrastive methods struggle with sophisticated edits due to insufficient fine-grained correspondence learning. We address this limitation by exploiting the inherent geometric traceability in edited content through two key innovations. First, we propose PixTrace - a pixel coordinate tracking module that maintains explicit spatial mappings across editing transformations. Second, we introduce CopyNCE, a geometrically-guided contrastive loss that regularizes patch affinity using overlap ratios derived from PixTrace's verified mappings. Our method bridges pixel-level traceability with patch-level similarity learning, suppressing supervision noise in SSL training. Extensive experiments demonstrate not only state-of-the-art performance (88.7% uAP / 83.9% RP90 for matcher, 72.6% uAP / 68.4% RP90 for descriptor on DISC21 dataset) but also better interpretability over existing methods.",
      "pdf": "https://arxiv.org/pdf/2602.17484v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17484v1",
      "abs_url": "https://arxiv.org/abs/2602.17484v1",
      "published": "2026-02-19"
    },
    {
      "title": "Variational Grey-Box Dynamics Matching",
      "authors": [
        "Gurjeet Sangra Singh",
        "Frantzeska Lavda",
        "Giangiacomo Mercatali",
        "Alexandros Kalousis"
      ],
      "abstract": "Deep generative models such as flow matching and diffusion models have shown great potential in learning complex distributions and dynamical systems, but often act as black-boxes, neglecting underlying physics. In contrast, physics-based simulation models described by ODEs/PDEs remain interpretable, but may have missing or unknown terms, unable to fully describe real-world observations. We bridge this gap with a novel grey-box method that integrates incomplete physics models directly into generative models. Our approach learns dynamics from observational trajectories alone, without ground-truth physics parameters, in a simulation-free manner that avoids scalability and stability issues of Neural ODEs. The core of our method lies in modelling a structured variational distribution within the flow matching framework, by using two latent encodings: one to model the missing stochasticity and multi-modal velocity, and a second to encode physics parameters as a latent variable with a physics-informed prior. Furthermore, we present an adaptation of the framework to handle second-order dynamics. Our experiments on representative ODE/PDE problems show that our method performs on par with or superior to fully data-driven approaches and previous grey-box baselines, while preserving the interpretability of the physics model. Our code is available at https://github.com/DMML-Geneva/VGB-DM.",
      "pdf": "https://arxiv.org/pdf/2602.17477v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17477v1",
      "abs_url": "https://arxiv.org/abs/2602.17477v1",
      "published": "2026-02-19"
    },
    {
      "title": "Optically Sensorized Electro-Ribbon Actuator (OS-ERA)",
      "authors": [
        "Carolina Gay",
        "Petr Trunin",
        "Diana Cafiso",
        "Yuejun Xu",
        "Majid Taghavi",
        "Lucia Beccai"
      ],
      "abstract": "Electro-Ribbon Actuators (ERAs) are lightweight flexural actuators that exhibit ultrahigh displacement and fast movement. However, their embedded sensing relies on capacitive sensors with limited precision, which hinders accurate control. We introduce OS-ERA, an optically sensorized ERA that yields reliable proprioceptive information, and we focus on the design and integration of a sensing solution without affecting actuation. To analyse the complex curvature of an ERA in motion, we design and embed two soft optical waveguide sensors. A classifier is trained to map the sensing signals in order to distinguish eight bending states. We validate our model on six held-out trials and compare it against signals' trajectories learned from training runs. Across all tests, the sensing output signals follow the training manifold, and the predicted sequence mirrors real performance and confirms repeatability. Despite deliberate train-test mismatches in actuation speed, the signal trajectories preserve their shape, and classification remains consistently accurate, demonstrating practical voltage- and speed-invariance. As a result, OS-ERA classifies bending states with high fidelity; it is fast and repeatable, solving a longstanding bottleneck of the ERA, enabling steps toward closed-loop control.",
      "pdf": "https://arxiv.org/pdf/2602.17474v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17474v1",
      "abs_url": "https://arxiv.org/abs/2602.17474v1",
      "published": "2026-02-19"
    },
    {
      "title": "A Cost-Effective and Climate-Resilient Air Pressure System for Rain Effect Reduction on Automated Vehicle Cameras",
      "authors": [
        "Mohamed Sabry",
        "Joseba Gorospe",
        "Cristina Olaverri-Monreal"
      ],
      "abstract": "Recent advances in automated vehicles have focused on improving perception performance under adverse weather conditions; however, research on physical hardware solutions remains limited, despite their importance for perception critical applications such as vehicle platooning. Existing approaches, such as hydrophilic or hydrophobic lenses and sprays, provide only partial mitigation, while industrial protection systems imply high cost and they do not enable scalability for automotive deployment.\n  To address these limitations, this paper presents a cost-effective hardware solution for rainy conditions, designed to be compatible with multiple cameras simultaneously.\n  Beyond its technical contribution, the proposed solution supports sustainability goals in transportation systems. By enabling compatibility with existing camera-based sensing platforms, the system extends the operational reliability of automated vehicles without requiring additional high-cost sensors or hardware replacements. This approach reduces resource consumption, supports modular upgrades, and promotes more cost-efficient deployment of automated vehicle technologies, particularly in challenging weather conditions where system failures would otherwise lead to inefficiencies and increased emissions. The proposed system was able to increase pedestrian detection accuracy of a Deep Learning model from 8.3% to 41.6%.",
      "pdf": "https://arxiv.org/pdf/2602.17472v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17472v1",
      "abs_url": "https://arxiv.org/abs/2602.17472v1",
      "published": "2026-02-19"
    },
    {
      "title": "Jolt Atlas: Verifiable Inference via Lookup Arguments in Zero Knowledge",
      "authors": [
        "Wyatt Benno",
        "Alberto Centelles",
        "Antoine Douchet",
        "Khalil Gibran"
      ],
      "abstract": "We present Jolt Atlas, a zero-knowledge machine learning (zkML) framework that extends the Jolt proving system to model inference. Unlike zkVMs (zero-knowledge virtual machines), which emulate CPU instruction execution, Jolt Atlas adapts Jolt's lookup-centric approach and applies it directly to ONNX tensor operations. The ONNX computational model eliminates the need for CPU registers and simplifies memory consistency verification. In addition, ONNX is an open-source, portable format, which makes it easy to share and deploy models across different frameworks, hardware platforms, and runtime environments without requiring framework-specific conversions.\n  Our lookup arguments, which use sumcheck protocol, are well-suited for non-linear functions -- key building blocks in modern ML. We apply optimisations such as neural teleportation to reduce the size of lookup tables while preserving model accuracy, as well as several tensor-level verification optimisations detailed in this paper. We demonstrate that Jolt Atlas can prove model inference in memory-constrained environments -- a prover property commonly referred to as \\textit{streaming}. Furthermore, we discuss how Jolt Atlas achieves zero-knowledge through the BlindFold technique, as introduced in Vega. In contrast to existing zkML frameworks, we show practical proving times for classification, embedding, automated reasoning, and small language models.\n  Jolt Atlas enables cryptographic verification that can be run on-device, without specialised hardware. The resulting proofs are succinctly verifiable. This makes Jolt Atlas well-suited for privacy-centric and adversarial environments. In a companion work, we outline various use cases of Jolt Atlas, including how it serves as guardrails in agentic commerce and for trustless AI context (often referred to as \\textit{AI memory}).",
      "pdf": "https://arxiv.org/pdf/2602.17452v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17452v1",
      "abs_url": "https://arxiv.org/abs/2602.17452v1",
      "published": "2026-02-19"
    },
    {
      "title": "ACOS: Arrays of Cheap Optical Switches",
      "authors": [
        "Daniel Amir",
        "Ori Cohen",
        "Jakob Krebs",
        "Mark Silberstein"
      ],
      "abstract": "Machine learning training places immense demands on cluster networks, motivating specialized architectures and co-design with parallelization strategies. Recent designs incorporating optical circuit switches (OCSes) are promising, offering improved cost, power efficiency, and long-term bandwidth scaling than packet switches. However, most existing approaches rely on costly high-radix OCSes and/or combine them with packet switches to achieve competitive performance at scale. Unfortunately, high-radix OCSes are both expensive and slow to reconfigure, limiting both scalability and performance.\n  We propose Arrays of Cheap Optical Switches (ACOS), which bring application co-design directly to the structure of the reconfigurable fabric. Using low-radix OCSes as building blocks, ACOS supports the forms of reconfiguration needed in training clusters including topology selection, workload adaptation, and failure resilience. The cost of ACOS scales with supported topologies and adaptations rather than with port count, breaking past the scalability barriers of current specialized ML networks. We show through simulation that ACOS-based deployments match the performance of fully provisioned packet-switched networks when training state-of-the-art LLMs at scale, while delivering significant cost savings using existing off-the-shelf OCSes, with strong bandwidth scaling and higher cost savings in the future.",
      "pdf": "https://arxiv.org/pdf/2602.17449v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17449v1",
      "abs_url": "https://arxiv.org/abs/2602.17449v1",
      "published": "2026-02-19"
    },
    {
      "title": "ABCD: All Biases Come Disguised",
      "authors": [
        "Mateusz Nowak",
        "Xavier Cadet",
        "Peter Chin"
      ],
      "abstract": "Multiple-choice question (MCQ) benchmarks have been a standard evaluation practice for measuring LLMs' ability to reason and answer knowledge-based questions. Through a synthetic NonsenseQA benchmark, we observe that different LLMs exhibit varying degrees of label-position-few-shot-prompt bias, where the model either uses the answer position, the label in front of the answer, the distributions of correct answers present in the few-shot prompt, or a combination of all to answer each MCQ question. We propose a simple bias-reduced evaluation protocol that replaces the labels of each question with uniform, unordered labels and prompts the LLM to use the whole answer presented. With a simple sentence similarity model, we demonstrate improved robustness and lower standard deviation between different permutations of answers with a minimal drop in LLM's performance, exposing the LLM's capabilities under reduced evaluation artifacts, without any help from the prompt examples or the option labels. Across multiple benchmarks and models, this protocol substantially improves the robustness to answer permutations, reducing mean accuracy variance $3\\times$ with only a minimal decrease in the mean model's performance. Through ablation studies on various embedding models and similarity functions, we show that the method is more robust than the standard ones.",
      "pdf": "https://arxiv.org/pdf/2602.17445v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17445v1",
      "abs_url": "https://arxiv.org/abs/2602.17445v1",
      "published": "2026-02-19"
    },
    {
      "title": "Fine-Grained Uncertainty Quantification for Long-Form Language Model Outputs: A Comparative Study",
      "authors": [
        "Dylan Bouchard",
        "Mohit Singh Chauhan",
        "Viren Bajaj",
        "David Skarbrevik"
      ],
      "abstract": "Uncertainty quantification has emerged as an effective approach to closed-book hallucination detection for LLMs, but existing methods are largely designed for short-form outputs and do not generalize well to long-form generation. We introduce a taxonomy for fine-grained uncertainty quantification in long-form LLM outputs that distinguishes methods by design choices at three stages: response decomposition, unit-level scoring, and response-level aggregation. We formalize several families of consistency-based black-box scorers, providing generalizations and extensions of existing methods. In our experiments across multiple LLMs and datasets, we find 1) claim-response entailment consistently performs better or on par with more complex claim-level scorers, 2) claim-level scoring generally yields better results than sentence-level scoring, and 3) uncertainty-aware decoding is highly effective for improving the factuality of long-form outputs. Our framework clarifies relationships between prior methods, enables apples-to-apples comparisons, and provides practical guidance for selecting components for fine-grained UQ.",
      "pdf": "https://arxiv.org/pdf/2602.17431v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17431v1",
      "abs_url": "https://arxiv.org/abs/2602.17431v1",
      "published": "2026-02-19"
    },
    {
      "title": "Evaluating Extremely Low-Resource Machine Translation: A Comparative Study of ChrF++ and BLEU Metrics",
      "authors": [
        "Sanjeev Kumar",
        "Preethi Jyothi",
        "Pushpak Bhattacharyya"
      ],
      "abstract": "Evaluating machine translation (MT) quality in extremely low-resource language (ELRL) scenarios poses unique challenges, as widely used metrics such as BLEU, effective in high-resource settings, often misrepresent quality in data-scarce contexts. This work presents a comparative analysis of BLEU, an n-gram-based metric, and ChrF++, a character-based metric, for MT evaluation in ELRL settings. We examine how each metric responds to translation artifacts, including hallucinations, repetition, source-text copying, and diacritic (\\textit{matra}) variations across three ELRLs: Magahi, Bhojpuri, and Chhattisgarhi, with a focus on outputs from large language models (LLMs) and neural MT (NMT) systems. While recent work often relies solely on ChrF++, our findings show that BLEU, despite its lower absolute scores, provides complementary lexical-precision insights that improve interpretability.",
      "pdf": "https://arxiv.org/pdf/2602.17425v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17425v1",
      "abs_url": "https://arxiv.org/abs/2602.17425v1",
      "published": "2026-02-19"
    },
    {
      "title": "Convergence Analysis of Two-Layer Neural Networks under Gaussian Input Masking",
      "authors": [
        "Afroditi Kolomvaki",
        "Fangshuo Liao",
        "Evan Dramko",
        "Ziyun Guang",
        "Anastasios Kyrillidis"
      ],
      "abstract": "We investigate the convergence guarantee of two-layer neural network training with Gaussian randomly masked inputs. This scenario corresponds to Gaussian dropout at the input level, or noisy input training common in sensor networks, privacy-preserving training, and federated learning, where each user may have access to partial or corrupted features. Using a Neural Tangent Kernel (NTK) analysis, we demonstrate that training a two-layer ReLU network with Gaussian randomly masked inputs achieves linear convergence up to an error region proportional to the mask's variance. A key technical contribution is resolving the randomness within the non-linear activation, a problem of independent interest.",
      "pdf": "https://arxiv.org/pdf/2602.17423v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17423v1",
      "abs_url": "https://arxiv.org/abs/2602.17423v1",
      "published": "2026-02-19"
    },
    {
      "title": "EAGLE: Expert-Augmented Attention Guidance for Tuning-Free Industrial Anomaly Detection in Multimodal Large Language Models",
      "authors": [
        "Xiaomeng Peng",
        "Xilang Huang",
        "Seon Han Choi"
      ],
      "abstract": "Industrial anomaly detection is important for smart manufacturing, but many deep learning approaches produce only binary decisions and provide limited semantic explanations. Multimodal large language models (MLLMs) can potentially generate fine-grained, language-based analyses, yet existing methods often require costly fine-tuning and do not consistently improve anomaly detection accuracy compared to lightweight specialist detectors. We propose expert-augmented attention guidance for industrial anomaly detection in MLLMs (EAGLE), a tuning-free framework that integrates outputs from expert model to guide MLLMs toward both accurate detection and interpretable anomaly descriptions. We further study how EAGLE affects MLLMs internals by examining the attention distribution of MLLMs to the anomalous image regions in the intermediate layers. We observe that successful anomaly detection is associated with increased attention concentration on anomalous regions, and EAGLE tends to encourage this alignment. Experiments on MVTec-AD and VisA show that EAGLE improves anomaly detection performance across multiple MLLMs without any parameter updates, achieving results comparable to fine-tuning based methods. Code is available at \\href{https://github.com/shengtun/Eagle}{https://github.com/shengtun/Eagle}",
      "pdf": "https://arxiv.org/pdf/2602.17419v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17419v1",
      "abs_url": "https://arxiv.org/abs/2602.17419v1",
      "published": "2026-02-19"
    },
    {
      "title": "DAVE: A Policy-Enforcing LLM Spokesperson for Secure Multi-Document Data Sharing",
      "authors": [
        "René Brinkhege",
        "Prahlad Menon"
      ],
      "abstract": "In current inter-organizational data spaces, usage policies are enforced mainly at the asset level: a whole document or dataset is either shared or withheld. When only parts of a document are sensitive, providers who want to avoid leaking protected information typically must manually redact documents before sharing them, which is costly, coarse-grained, and hard to maintain as policies or partners change. We present DAVE, a usage policy-enforcing LLM spokesperson that answers questions over private documents on behalf of a data provider. Instead of releasing documents, the provider exposes a natural language interface whose responses are constrained by machine-readable usage policies. We formalize policy-violating information disclosure in this setting, drawing on usage control and information flow security, and introduce virtual redaction: suppressing sensitive information at query time without modifying source documents. We describe an architecture for integrating such a spokesperson with Eclipse Dataspace Components and ODRL-style policies, and outline an initial provider-side integration prototype in which QA requests are routed through a spokesperson service instead of triggering raw document transfer. Our contribution is primarily architectural: we do not yet implement or empirically evaluate the full enforcement pipeline. We therefore outline an evaluation methodology to assess security, utility, and performance trade-offs under benign and adversarial querying as a basis for future empirical work on systematically governed LLM access to multi-party data spaces.",
      "pdf": "https://arxiv.org/pdf/2602.17413v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17413v1",
      "abs_url": "https://arxiv.org/abs/2602.17413v1",
      "published": "2026-02-19"
    },
    {
      "title": "Improving LLM-based Recommendation with Self-Hard Negatives from Intermediate Layers",
      "authors": [
        "Bingqian Li",
        "Bowen Zheng",
        "Xiaolei Wang",
        "Long Zhang",
        "Jinpeng Wang",
        "Sheng Chen",
        "Wayne Xin Zhao",
        "Ji-rong Wen"
      ],
      "abstract": "Large language models (LLMs) have shown great promise in recommender systems, where supervised fine-tuning (SFT) is commonly used for adaptation. Subsequent studies further introduce preference learning to incorporate negative samples into the training process. However, existing methods rely on sequence-level, offline-generated negatives, making them less discriminative and informative when adapting LLMs to recommendation tasks with large negative item spaces. To address these challenges, we propose ILRec, a novel preference fine-tuning framework for LLM-based recommendation, leveraging self-hard negative signals extracted from intermediate layers to improve preference learning. Specifically, we identify self-hard negative tokens from intermediate layers as fine-grained negative supervision that dynamically reflects the model's preference learning process. To effectively integrate these signals into training, we design a two-stage framework comprising cross-layer preference optimization and cross-layer preference distillation, enabling the model to jointly discriminate informative negatives and enhance the quality of negative signals from intermediate layers. In addition, we introduce a lightweight collaborative filtering model to assign token-level rewards for negative signals, mitigating the risk of over-penalizing false negatives. Extensive experiments on three datasets demonstrate ILRec's effectiveness in enhancing the performance of LLM-based recommender systems.",
      "pdf": "https://arxiv.org/pdf/2602.17410v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17410v1",
      "abs_url": "https://arxiv.org/abs/2602.17410v1",
      "published": "2026-02-19"
    },
    {
      "title": "A Contrastive Variational AutoEncoder for NSCLC Survival Prediction with Missing Modalities",
      "authors": [
        "Michele Zanitti",
        "Vanja Miskovic",
        "Francesco Trovò",
        "Alessandra Laura Giulia Pedrocchi",
        "Ming Shen",
        "Yan Kyaw Tun",
        "Arsela Prelaj",
        "Sokol Kosta"
      ],
      "abstract": "Predicting survival outcomes for non-small cell lung cancer (NSCLC) patients is challenging due to the different individual prognostic features. This task can benefit from the integration of whole-slide images, bulk transcriptomics, and DNA methylation, which offer complementary views of the patient's condition at diagnosis. However, real-world clinical datasets are often incomplete, with entire modalities missing for a significant fraction of patients. State-of-the-art models rely on available data to create patient-level representations or use generative models to infer missing modalities, but they lack robustness in cases of severe missingness. We propose a Multimodal Contrastive Variational AutoEncoder (MCVAE) to address this issue: modality-specific variational encoders capture the uncertainty in each data source, and a fusion bottleneck with learned gating mechanisms is introduced to normalize the contributions from present modalities. We propose a multi-task objective that combines survival loss and reconstruction loss to regularize patient representations, along with a cross-modal contrastive loss that enforces cross-modal alignment in the latent space. During training, we apply stochastic modality masking to improve the robustness to arbitrary missingness patterns. Extensive evaluations on the TCGA-LUAD (n=475) and TCGA-LUSC (n=446) datasets demonstrate the efficacy of our approach in predicting disease-specific survival (DSS) and its robustness to severe missingness scenarios compared to two state-of-the-art models. Finally, we bring some clarifications on multimodal integration by testing our model on all subsets of modalities, finding that integration is not always beneficial to the task.",
      "pdf": "https://arxiv.org/pdf/2602.17402v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17402v1",
      "abs_url": "https://arxiv.org/abs/2602.17402v1",
      "published": "2026-02-19"
    },
    {
      "title": "SpectralGCD: Spectral Concept Selection and Cross-modal Representation Learning for Generalized Category Discovery",
      "authors": [
        "Lorenzo Caselli",
        "Marco Mistretta",
        "Simone Magistri",
        "Andrew D. Bagdanov"
      ],
      "abstract": "Generalized Category Discovery (GCD) aims to identify novel categories in unlabeled data while leveraging a small labeled subset of known classes. Training a parametric classifier solely on image features often leads to overfitting to old classes, and recent multimodal approaches improve performance by incorporating textual information. However, they treat modalities independently and incur high computational cost. We propose SpectralGCD, an efficient and effective multimodal approach to GCD that uses CLIP cross-modal image-concept similarities as a unified cross-modal representation. Each image is expressed as a mixture over semantic concepts from a large task-agnostic dictionary, which anchors learning to explicit semantics and reduces reliance on spurious visual cues. To maintain the semantic quality of representations learned by an efficient student, we introduce Spectral Filtering which exploits a cross-modal covariance matrix over the softmaxed similarities measured by a strong teacher model to automatically retain only relevant concepts from the dictionary. Forward and reverse knowledge distillation from the same teacher ensures that the cross-modal representations of the student remain both semantically sufficient and well-aligned. Across six benchmarks, SpectralGCD delivers accuracy comparable to or significantly superior to state-of-the-art methods at a fraction of the computational cost. The code is publicly available at: https://github.com/miccunifi/SpectralGCD.",
      "pdf": "https://arxiv.org/pdf/2602.17395v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17395v1",
      "abs_url": "https://arxiv.org/abs/2602.17395v1",
      "published": "2026-02-19"
    },
    {
      "title": "Voice-Driven Semantic Perception for UAV-Assisted Emergency Networks",
      "authors": [
        "Nuno Saavedra",
        "Pedro Ribeiro",
        "André Coelho",
        "Rui Campos"
      ],
      "abstract": "Unmanned Aerial Vehicle (UAV)-assisted networks are increasingly foreseen as a promising approach for emergency response, providing rapid, flexible, and resilient communications in environments where terrestrial infrastructure is degraded or unavailable. In such scenarios, voice radio communications remain essential for first responders due to their robustness; however, their unstructured nature prevents direct integration with automated UAV-assisted network management. This paper proposes SIREN, an AI-driven framework that enables voice-driven perception for UAV-assisted networks. By integrating Automatic Speech Recognition (ASR) with Large Language Model (LLM)-based semantic extraction and Natural Language Processing (NLP) validation, SIREN converts emergency voice traffic into structured, machine-readable information, including responding units, location references, emergency severity, and Quality-of-Service (QoS) requirements. SIREN is evaluated using synthetic emergency scenarios with controlled variations in language, speaker count, background noise, and message complexity. The results demonstrate robust transcription and reliable semantic extraction across diverse operating conditions, while highlighting speaker diarization and geographic ambiguity as the main limiting factors. These findings establish the feasibility of voice-driven situational awareness for UAV-assisted networks and show a practical foundation for human-in-the-loop decision support and adaptive network management in emergency response operations.",
      "pdf": "https://arxiv.org/pdf/2602.17394v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17394v1",
      "abs_url": "https://arxiv.org/abs/2602.17394v1",
      "published": "2026-02-19"
    },
    {
      "title": "Visual Model Checking: Graph-Based Inference of Visual Routines for Image Retrieval",
      "authors": [
        "Adrià Molina",
        "Oriol Ramos Terrades",
        "Josep Lladós"
      ],
      "abstract": "Information retrieval lies at the foundation of the modern digital industry. While natural language search has seen dramatic progress in recent years largely driven by embedding-based models and large-scale pretraining, the field still faces significant challenges. Specifically, queries that involve complex relationships, object compositions, or precise constraints such as identities, counts and proportions often remain unresolved or unreliable within current frameworks. In this paper, we propose a novel framework that integrates formal verification into deep learning-based image retrieval through a synergistic combination of graph-based verification methods and neural code generation. Our approach aims to support open-vocabulary natural language queries while producing results that are both trustworthy and verifiable. By grounding retrieval results in a system of formal reasoning, we move beyond the ambiguity and approximation that often characterize vector representations. Instead of accepting uncertainty as a given, our framework explicitly verifies each atomic truth in the user query against the retrieved content. This allows us to not only return matching results, but also to identify and mark which specific constraints are satisfied and which remain unmet, thereby offering a more transparent and accountable retrieval process while boosting the results of the most popular embedding-based approaches.",
      "pdf": "https://arxiv.org/pdf/2602.17386v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17386v1",
      "abs_url": "https://arxiv.org/abs/2602.17386v1",
      "published": "2026-02-19"
    },
    {
      "title": "Data-Driven Prediction of Dielectric Anisotropy in Nematic Liquid Crystals",
      "authors": [
        "Charles Parton-Barr",
        "Richard J. Mandle"
      ],
      "abstract": "We curate a large-scale dataset of low frequency dielectric anisotropy values for low molecular weight liquid crystals. Using this dataset, we demonstrate that supervised machine-learning models can predict dielectric anisotropy with substantially improved accuracy (RMSE 2.6) compared to estimates obtained from the Maier-Meier relations using molecular properties from both the widely used semiempirical AM1 method (RMSE 9.7) and the modern r2scan-3c composite method (RMSE 11.2). Realising the potential of machine learning techniques for liquid crystalline materials requires carefully curated data to be accessible, and on this basis we propose a simple and standard template for reporting data.",
      "pdf": "https://arxiv.org/pdf/2602.17382v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17382v1",
      "abs_url": "https://arxiv.org/abs/2602.17382v1",
      "published": "2026-02-19"
    },
    {
      "title": "MDP Planning as Policy Inference",
      "authors": [
        "David Tolpin"
      ],
      "abstract": "We cast episodic Markov decision process (MDP) planning as Bayesian inference over _policies_. A policy is treated as the latent variable and is assigned an unnormalized probability of optimality that is monotone in its expected return, yielding a posterior distribution whose modes coincide with return-maximizing solutions while posterior dispersion represents uncertainty over optimal behavior. To approximate this posterior in discrete domains, we adapt variational sequential Monte Carlo (VSMC) to inference over deterministic policies under stochastic dynamics, introducing a sweep that enforces policy consistency across revisited states and couples transition randomness across particles to avoid confounding from simulator noise. Acting is performed by posterior predictive sampling, which induces a stochastic control policy through a Thompson-sampling interpretation rather than entropy regularization. Across grid worlds, Blackjack, Triangle Tireworld, and Academic Advising, we analyze the structure of inferred policy distributions and compare the resulting behavior to discrete Soft Actor-Critic, highlighting qualitative and statistical differences that arise from policy-level uncertainty.",
      "pdf": "https://arxiv.org/pdf/2602.17375v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17375v1",
      "abs_url": "https://arxiv.org/abs/2602.17375v1",
      "published": "2026-02-19"
    },
    {
      "title": "Tree crop mapping of South America reveals links to deforestation and conservation",
      "authors": [
        "Yuchang Jiang",
        "Anton Raichuk",
        "Xiaoye Tong",
        "Vivien Sainte Fare Garnot",
        "Daniel Ortiz-Gonzalo",
        "Dan Morris",
        "Konrad Schindler",
        "Jan Dirk Wegner",
        "Maxim Neumann"
      ],
      "abstract": "Monitoring tree crop expansion is vital for zero-deforestation policies like the European Union's Regulation on Deforestation-free Products (EUDR). However, these efforts are hindered by a lack of highresolution data distinguishing diverse agricultural systems from forests. Here, we present the first 10m-resolution tree crop map for South America, generated using a multi-modal, spatio-temporal deep learning model trained on Sentinel-1 and Sentinel-2 satellite imagery time series. The map identifies approximately 11 million hectares of tree crops, 23% of which is linked to 2000-2020 forest cover loss. Critically, our analysis reveals that existing regulatory maps supporting the EUDR often classify established agriculture, particularly smallholder agroforestry, as \"forest\". This discrepancy risks false deforestation alerts and unfair penalties for small-scale farmers. Our work mitigates this risk by providing a high-resolution baseline, supporting conservation policies that are effective, inclusive, and equitable.",
      "pdf": "https://arxiv.org/pdf/2602.17372v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17372v1",
      "abs_url": "https://arxiv.org/abs/2602.17372v1",
      "published": "2026-02-19"
    },
    {
      "title": "Dynamical Modelling of Galactic Kinematics using Neural Networks",
      "authors": [
        "David A. Simon",
        "Michele Cappellari",
        "Shude Mao",
        "Jiani Chu",
        "Dandan Xu"
      ],
      "abstract": "The advent of integral field data has revolutionised the study of galaxy evolution. A key component of this is dynamical modelling methods which have allowed for crucial insights to be made from kinematic data. Despite this importance, most dynamical models make a number of key assumptions which do not hold for real galaxies. These include assumptions about the geometry (axisymmetry or triaxiality), the shape of the velocity ellipsoid, and the shape of the underlying stellar distribution. At the same time, machine learning methods are becoming increasingly powerful, with many applications appearing in astronomy. As a first step towards building new dynamical modelling methods with machine learning, it is important to understand the types of machine learning architectures that are best fit for dynamical modelling. To investigate this, we construct a training set of dynamical models of early-type galaxies using Jeans Anisotropic Modelling (JAM). We then train a neural network on this data using the parameters of JAM and mock photometry as the input. We are able to accurately model JAM galaxies with relatively simple machine learning architectures, leading to a significant speed increase over traditional JAM modelling.",
      "pdf": "https://arxiv.org/pdf/2602.17371v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17371v1",
      "abs_url": "https://arxiv.org/abs/2602.17371v1",
      "published": "2026-02-19"
    },
    {
      "title": "RPDR: A Round-trip Prediction-Based Data Augmentation Framework for Long-Tail Question Answering",
      "authors": [
        "Yiming Zhang",
        "Siyue Zhang",
        "Junbo Zhao",
        "Chen Zhao"
      ],
      "abstract": "Long-tail question answering presents significant challenges for large language models (LLMs) due to their limited ability to acquire and accurately recall less common knowledge. Retrieval-augmented generation (RAG) systems have shown great promise in mitigating this limitation by integrating external retrieval mechanisms. However, dense retrieval models often face the same difficulties when generalizing to rare or niche knowledge. In this study, we introduce RPDR, a novel data augmentation framework that selects high-quality easy-to-learn training data, to enhance dense retrievers. Our approach is built around three core components: synthetic data generation, data selection with Round-Trip prediction to identify easy-to-learn instances, and retriever training with these instances. We evaluate RPDR on two long-tail retrieval benchmarks, PopQA and EntityQuestion, demonstrating substantial improvements over existing retrievers like BM25 and Contriver, especially on extremely long-tail categories. We identify the strengths and limitations of RPDR through detailed human analysis and propose a dynamic routing mechanism to dynamically route queries to specialized retrieval modules to further improve retrieval performance.",
      "pdf": "https://arxiv.org/pdf/2602.17366v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17366v1",
      "abs_url": "https://arxiv.org/abs/2602.17366v1",
      "published": "2026-02-19"
    },
    {
      "title": "Computer-Using World Model",
      "authors": [
        "Yiming Guan",
        "Rui Yu",
        "John Zhang",
        "Lu Wang",
        "Chaoyun Zhang",
        "Liqun Li",
        "Bo Qiao",
        "Si Qin",
        "He Huang",
        "Fangkai Yang",
        "Pu Zhao",
        "Lukas Wutschitz",
        "Samuel Kessler",
        "Huseyin A Inan",
        "Robert Sim",
        "Saravan Rajmohan",
        "Qingwei Lin",
        "Dongmei Zhang"
      ],
      "abstract": "Agents operating in complex software environments benefit from reasoning about the consequences of their actions, as even a single incorrect user interface (UI) operation can derail long, artifact-preserving workflows. This challenge is particularly acute for computer-using scenarios, where real execution does not support counterfactual exploration, making large-scale trial-and-error learning and planning impractical despite the environment being fully digital and deterministic. We introduce the Computer-Using World Model (CUWM), a world model for desktop software that predicts the next UI state given the current state and a candidate action. CUWM adopts a two-stage factorization of UI dynamics: it first predicts a textual description of agent-relevant state changes, and then realizes these changes visually to synthesize the next screenshot. CUWM is trained on offline UI transitions collected from agents interacting with real Microsoft Office applications, and further refined with a lightweight reinforcement learning stage that aligns textual transition predictions with the structural requirements of computer-using environments. We evaluate CUWM via test-time action search, where a frozen agent uses the world model to simulate and compare candidate actions before execution. Across a range of Office tasks, world-model-guided test-time scaling improves decision quality and execution robustness.",
      "pdf": "https://arxiv.org/pdf/2602.17365v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17365v1",
      "abs_url": "https://arxiv.org/abs/2602.17365v1",
      "published": "2026-02-19"
    },
    {
      "title": "A feature-stable and explainable machine learning framework for trustworthy decision-making under incomplete clinical data",
      "authors": [
        "Justyna Andrys-Olek",
        "Paulina Tworek",
        "Luca Gherardini",
        "Mark W. Ruddock",
        "Mary Jo Kurt",
        "Peter Fitzgerald",
        "Jose Sousa"
      ],
      "abstract": "Machine learning models are increasingly applied to biomedical data, yet their adoption in high stakes domains remains limited by poor robustness, limited interpretability, and instability of learned features under realistic data perturbations, such as missingness. In particular, models that achieve high predictive performance may still fail to inspire trust if their key features fluctuate when data completeness changes, undermining reproducibility and downstream decision-making. Here, we present CACTUS (Comprehensive Abstraction and Classification Tool for Uncovering Structures), an explainable machine learning framework explicitly designed to address these challenges in small, heterogeneous, and incomplete clinical datasets. CACTUS integrates feature abstraction, interpretable classification, and systematic feature stability analysis to quantify how consistently informative features are preserved as data quality degrades. Using a real-world haematuria cohort comprising 568 patients evaluated for bladder cancer, we benchmark CACTUS against widely used machine learning approaches, including random forests and gradient boosting methods, under controlled levels of randomly introduced missing data. We demonstrate that CACTUS achieves competitive or superior predictive performance while maintaining markedly higher stability of top-ranked features as missingness increases, including in sex-stratified analyses. Our results show that feature stability provides information complementary to conventional performance metrics and is essential for assessing the trustworthiness of machine learning models applied to biomedical data. By explicitly quantifying robustness to missing data and prioritising interpretable, stable features, CACTUS offers a generalizable framework for trustworthy data-driven decision support.",
      "pdf": "https://arxiv.org/pdf/2602.17364v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17364v1",
      "abs_url": "https://arxiv.org/abs/2602.17364v1",
      "published": "2026-02-19"
    },
    {
      "title": "2Mamba2Furious: Linear in Complexity, Competitive in Accuracy",
      "authors": [
        "Gabriel Mongaras",
        "Eric C. Larson"
      ],
      "abstract": "Linear attention transformers have become a strong alternative to softmax attention due to their efficiency. However, linear attention tends to be less expressive and results in reduced accuracy compared to softmax attention. To bridge the accuracy gap between softmax attention and linear attention, we manipulate Mamba-2, a very strong linear attention variant. We first simplify Mamba-2 down to its most fundamental and important components, evaluating which specific choices make it most accurate. From this simplified Mamba variant (Mamba-2S), we improve the A-mask and increase the order of the hidden state, resulting in a method, which we call 2Mamba, that is nearly as accurate as softmax attention, yet much more memory efficient for long context lengths. We also investigate elements to Mamba-2 that help surpass softmax attention accuracy. Code is provided for all our experiments",
      "pdf": "https://arxiv.org/pdf/2602.17363v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17363v1",
      "abs_url": "https://arxiv.org/abs/2602.17363v1",
      "published": "2026-02-19"
    },
    {
      "title": "Training-free Graph-based Imputation of Missing Modalities in Multimodal Recommendation",
      "authors": [
        "Daniele Malitesta",
        "Emanuele Rossi",
        "Claudio Pomo",
        "Tommaso Di Noia",
        "Fragkiskos D. Malliaros"
      ],
      "abstract": "Multimodal recommender systems (RSs) represent items in the catalog through multimodal data (e.g., product images and descriptions) that, in some cases, might be noisy or (even worse) missing. In those scenarios, the common practice is to drop items with missing modalities and train the multimodal RSs on a subsample of the original dataset. To date, the problem of missing modalities in multimodal recommendation has still received limited attention in the literature, lacking a precise formalisation as done with missing information in traditional machine learning. In this work, we first provide a problem formalisation for missing modalities in multimodal recommendation. Second, by leveraging the user-item graph structure, we re-cast the problem of missing multimodal information as a problem of graph features interpolation on the item-item co-purchase graph. On this basis, we propose four training-free approaches that propagate the available multimodal features throughout the item-item graph to impute the missing features. Extensive experiments on popular multimodal recommendation datasets demonstrate that our solutions can be seamlessly plugged into any existing multimodal RS and benchmarking framework while still preserving (or even widen) the performance gap between multimodal and traditional RSs. Moreover, we show that our graph-based techniques can perform better than traditional imputations in machine learning under different missing modalities settings. Finally, we analyse (for the first time in multimodal RSs) how feature homophily calculated on the item-item graph can influence our graph-based imputations.",
      "pdf": "https://arxiv.org/pdf/2602.17354v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17354v1",
      "abs_url": "https://arxiv.org/abs/2602.17354v1",
      "published": "2026-02-19"
    },
    {
      "title": "Shortcut learning in geometric knot classification",
      "authors": [
        "Djordje Mihajlovic",
        "Davide Michieletto"
      ],
      "abstract": "Classifying the topology of closed curves is a central problem in low dimensional topology with applications beyond mathematics spanning protein folding, polymer physics and even magnetohydrodynamics. The central problem is how to determine whether two embeddings of a closed arc are equivalent under ambient isotopy. Given the striking ability of neural networks to solve complex classification tasks, it is therefore natural to ask if the knot classification problem can be tackled using Machine Learning (ML). In this paper, we investigate generic shortcut methods employed by ML to solve the knot classification challenge and specifically discover hidden non-topological features in training data generated through Molecular Dynamics simulations of polygonal knots that are used by ML to arrive to positive classifications results. We then provide a rigorous foundation for future attempts to tackle the knot classification challenge using ML by developing a publicly-available (i) dataset, that aims to remove the potential of non-topological feature classification and (ii) code, that can generate knot embeddings that faithfully explore chosen geometric state space with fixed knot topology. We expect that our work will accelerate the development of ML models that can solve complex geometric knot classification challenges.",
      "pdf": "https://arxiv.org/pdf/2602.17350v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17350v1",
      "abs_url": "https://arxiv.org/abs/2602.17350v1",
      "published": "2026-02-19"
    },
    {
      "title": "Partial Optimality in the Preordering Problem",
      "authors": [
        "David Stein",
        "Jannik Irmai",
        "Bjoern Andres"
      ],
      "abstract": "Preordering is a generalization of clustering and partial ordering with applications in bioinformatics and social network analysis. Given a finite set $V$ and a value $c_{ab} \\in \\mathbb{R}$ for every ordered pair $ab$ of elements of $V$, the preordering problem asks for a preorder $\\lesssim$ on $V$ that maximizes the sum of the values of those pairs $ab$ for which $a \\lesssim b$. Building on the state of the art in solving this NP-hard problem partially, we contribute new partial optimality conditions and efficient algorithms for deciding these conditions. In experiments with real and synthetic data, these new conditions increase, in particular, the fraction of pairs $ab$ for which it is decided efficiently that $a \\not\\lesssim b$ in an optimal preorder.",
      "pdf": "https://arxiv.org/pdf/2602.17346v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17346v1",
      "abs_url": "https://arxiv.org/abs/2602.17346v1",
      "published": "2026-02-19"
    },
    {
      "title": "From Subtle to Significant: Prompt-Driven Self-Improving Optimization in Test-Time Graph OOD Detection",
      "authors": [
        "Luzhi Wang",
        "Xuanshuo Fu",
        "He Zhang",
        "Chuang Liu",
        "Xiaobao Wang",
        "Hongbo Liu"
      ],
      "abstract": "Graph Out-of-Distribution (OOD) detection aims to identify whether a test graph deviates from the distribution of graphs observed during training, which is critical for ensuring the reliability of Graph Neural Networks (GNNs) when deployed in open-world scenarios. Recent advances in graph OOD detection have focused on test-time training techniques that facilitate OOD detection without accessing potential supervisory information (e.g., training data). However, most of these methods employ a one-pass inference paradigm, which prevents them from progressively correcting erroneous predictions to amplify OOD signals. To this end, we propose a \\textbf{S}elf-\\textbf{I}mproving \\textbf{G}raph \\textbf{O}ut-\\textbf{o}f-\\textbf{D}istribution detector (SIGOOD), which is an unsupervised framework that integrates continuous self-learning with test-time training for effective graph OOD detection. Specifically, SIGOOD generates a prompt to construct a prompt-enhanced graph that amplifies potential OOD signals. To optimize prompts, SIGOOD introduces an Energy Preference Optimization (EPO) loss, which leverages energy variations between the original test graph and the prompt-enhanced graph. By iteratively optimizing the prompt by involving it into the detection model in a self-improving loop, the resulting optimal prompt-enhanced graph is ultimately used for OOD detection. Comprehensive evaluations on 21 real-world datasets confirm the effectiveness and outperformance of our SIGOOD method. The code is at https://github.com/Ee1s/SIGOOD.",
      "pdf": "https://arxiv.org/pdf/2602.17342v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17342v1",
      "abs_url": "https://arxiv.org/abs/2602.17342v1",
      "published": "2026-02-19"
    },
    {
      "title": "Detecting nonequilibrium phase transitions via continuous monitoring of space-time trajectories and autoencoder-based clustering",
      "authors": [
        "Erik Fitzner",
        "Francesco Carnazza",
        "Federico Carollo",
        "Igor Lesanovsky"
      ],
      "abstract": "The characterization of collective behavior and nonequilibrium phase transitions in quantum systems is typically rooted in the analysis of suitable system observables, so-called order parameters. These observables might not be known a priori, but they may in principle be identified through analyzing the quantum state of the system. Experimentally, this can be particularly demanding as estimating quantum states and expectation values of quantum observables requires a large number of projective measurements. However, open quantum systems can be probed in situ by monitoring their output, e.g. via heterodyne-detection or photon-counting experiments, which provide space-time resolved information about their dynamics. Building on this, we present a machine-learning approach to detect nonequilibrium phase transitions from the measurement time-records of continuously-monitored quantum systems. We benchmark our method using the quantum contact process, a model featuring an absorbing-state phase transition, which constitutes a particularly challenging test case for the quantum simulation of nonequilibrium processes.",
      "pdf": "https://arxiv.org/pdf/2602.17341v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17341v1",
      "abs_url": "https://arxiv.org/abs/2602.17341v1",
      "published": "2026-02-19"
    },
    {
      "title": "PersonaMail: Learning and Adapting Personal Communication Preferences for Context-Aware Email Writing",
      "authors": [
        "Rui Yao",
        "Qiuyuan Ren",
        "Felicia Fang-Yi Tan",
        "Chen Yang",
        "Xiaoyu Zhang",
        "Shengdong Zhao"
      ],
      "abstract": "LLM-assisted writing has seen rapid adoption in interpersonal communication, yet current systems often fail to capture the subtle tones essential for effectiveness. Email writing exemplifies this challenge: effective messages require careful alignment with intent, relationship, and context beyond mere fluency. Through formative studies, we identified three key challenges: articulating nuanced communicative intent, making modifications at multiple levels of granularity, and reusing effective tone strategies across messages. We developed PersonaMail, a system that addresses these gaps through structured communication factor exploration, granular editing controls, and adaptive reuse of successful strategies. Our evaluation compared PersonaMail against standard LLM interfaces, and showed improved efficiency in both immediate and repeated use, alongside higher user satisfaction. We contribute design implications for AI-assisted communication systems that prioritize interpersonal nuance over generic text generation.",
      "pdf": "https://arxiv.org/pdf/2602.17340v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17340v1",
      "abs_url": "https://arxiv.org/abs/2602.17340v1",
      "published": "2026-02-19"
    },
    {
      "title": "Polaffini: A feature-based approach for robust affine and polyaffine image registration",
      "authors": [
        "Antoine Legouhy",
        "Cosimo Campo",
        "Ross Callaghan",
        "Hojjat Azadbakht",
        "Hui Zhang"
      ],
      "abstract": "In this work we present Polaffini, a robust and versatile framework for anatomically grounded registration. Medical image registration is dominated by intensity-based registration methods that rely on surrogate measures of alignment quality. In contrast, feature-based approaches that operate by identifying explicit anatomical correspondences, while more desirable in theory, have largely fallen out of favor due to the challenges of reliably extracting features. However, such challenges are now significantly overcome thanks to recent advances in deep learning, which provide pre-trained segmentation models capable of instantly delivering reliable, fine-grained anatomical delineations. We aim to demonstrate that these advances can be leveraged to create new anatomically-grounded image registration algorithms. To this end, we propose Polaffini, which obtains, from these segmented regions, anatomically grounded feature points with 1-to-1 correspondence in a particularly simple way: extracting their centroids. These enable efficient global and local affine matching via closed-form solutions. Those are used to produce an overall transformation ranging from affine to polyaffine with tunable smoothness. Polyaffine transformations can have many more degrees of freedom than affine ones allowing for finer alignment, and their embedding in the log-Euclidean framework ensures diffeomorphic properties. Polaffini has applications both for standalone registration and as pre-alignment for subsequent non-linear registration, and we evaluate it against popular intensity-based registration techniques. Results demonstrate that Polaffini outperforms competing methods in terms of structural alignment and provides improved initialisation for downstream non-linear registration. Polaffini is fast, robust, and accurate, making it particularly well-suited for integration into medical image processing pipelines.",
      "pdf": "https://arxiv.org/pdf/2602.17337v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17337v1",
      "abs_url": "https://arxiv.org/abs/2602.17337v1",
      "published": "2026-02-19"
    },
    {
      "title": "Semi-Local Exchange-Correlation Approximations in Density Functional Theory",
      "authors": [
        "Fabien Tran",
        "Susi Lehtola",
        "Stefano Pittalis",
        "Miguel A. L. Marques"
      ],
      "abstract": "Density functional theory is the workhorse of modern electronic structure calculations, with wide-ranging applications in chemistry, physics, materials science, and machine learning. At its heart lies the exchange-correlation functional, a quantity which exactly encapsulates the many-body effects stemming from the quantum mechanical interactions between the electrons. Yet, the exact functional is unknown, and computationally tractable approximations are therefore necessary for practical applications. Over the past six decades, hundreds of density functional approximations have been proposed with varying degrees of accuracy and computational efficiency.\n  This review surveys the theoretical foundations of semi-local functionals, including local density approximations, generalized gradient approximations, and meta-generalized gradient approximations. We provide a comprehensive, consistently organized discussion that consolidates both historical developments and recent advances in this field. Beginning with the essential concepts of Kohn-Sham density functional theory, we present the construction principles of semi-local exchange-correlation functionals. Special attention is given to the physical motivations underlying functional development, the mathematical properties that guide their construction, and the practical considerations that determine their applicability across different chemical and physical systems.\n  This work is intended to serve as both a introduction for newcomers to the field and a comprehensive reference for practitioners. By consolidating the extensive literature on semi-local functionals and providing a unified framework for understanding their construction and application, we aim to facilitate further developments in density functional approximations and their use in tackling the diverse challenges of modern computational chemistry and condensed matter physics.",
      "pdf": "https://arxiv.org/pdf/2602.17333v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17333v1",
      "abs_url": "https://arxiv.org/abs/2602.17333v1",
      "published": "2026-02-19"
    },
    {
      "title": "SubQuad: Near-Quadratic-Free Structure Inference with Distribution-Balanced Objectives in Adaptive Receptor framework",
      "authors": [
        "Rong Fu",
        "Zijian Zhang",
        "Wenxin Zhang",
        "Kun Liu",
        "Jiekai Wu",
        "Xianda Li",
        "Simon Fong"
      ],
      "abstract": "Comparative analysis of adaptive immune repertoires at population scale is hampered by two practical bottlenecks: the near-quadratic cost of pairwise affinity evaluations and dataset imbalances that obscure clinically important minority clonotypes. We introduce SubQuad, an end-to-end pipeline that addresses these challenges by combining antigen-aware, near-subquadratic retrieval with GPU-accelerated affinity kernels, learned multimodal fusion, and fairness-constrained clustering. The system employs compact MinHash prefiltering to sharply reduce candidate comparisons, a differentiable gating module that adaptively weights complementary alignment and embedding channels on a per-pair basis, and an automated calibration routine that enforces proportional representation of rare antigen-specific subgroups. On large viral and tumor repertoires SubQuad achieves measured gains in throughput and peak memory usage while preserving or improving recall@k, cluster purity, and subgroup equity. By co-designing indexing, similarity fusion, and equity-aware objectives, SubQuad offers a scalable, bias-aware platform for repertoire mining and downstream translational tasks such as vaccine target prioritization and biomarker discovery.",
      "pdf": "https://arxiv.org/pdf/2602.17330v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17330v1",
      "abs_url": "https://arxiv.org/abs/2602.17330v1",
      "published": "2026-02-19"
    },
    {
      "title": "WebFAQ 2.0: A Multilingual QA Dataset with Mined Hard Negatives for Dense Retrieval",
      "authors": [
        "Michael Dinzinger",
        "Laura Caspari",
        "Ali Salman",
        "Irvin Topi",
        "Jelena Mitrović",
        "Michael Granitzer"
      ],
      "abstract": "We introduce WebFAQ 2.0, a new version of the WebFAQ dataset, containing 198 million FAQ-based natural question-answer pairs across 108 languages. Compared to the previous version, it significantly expands multilingual coverage and the number of bilingual aligned QA pairs to over 14.3M, making it the largest FAQ-based resource. Unlike the original release, WebFAQ 2.0 uses a novel data collection strategy that directly crawls and extracts relevant web content, resulting in a substantially more diverse and multilingual dataset with richer context through page titles and descriptions. In response to community feedback, we also release a hard negatives dataset for training dense retrievers, with 1.25M queries across 20 languages. These hard negatives were mined using a two-stage retrieval pipeline and include cross-encoder scores for 200 negatives per query. We further show how this resource enables two primary fine-tuning strategies for dense retrievers: Contrastive Learning with MultipleNegativesRanking loss, and Knowledge Distillation with MarginMSE loss. WebFAQ 2.0 is not a static resource but part of a long-term effort. Since late 2025, structured FAQs are being regularly released through the Open Web Index, enabling continuous expansion and refinement. We publish the datasets and training scripts to facilitate further research in multilingual and cross-lingual IR. The dataset itself and all related resources are publicly available on GitHub and HuggingFace.",
      "pdf": "https://arxiv.org/pdf/2602.17327v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17327v1",
      "abs_url": "https://arxiv.org/abs/2602.17327v1",
      "published": "2026-02-19"
    },
    {
      "title": "Leveraging Contrastive Learning for a Similarity-Guided Tampered Document Data Generation Pipeline",
      "authors": [
        "Mohamed Dhouib",
        "Davide Buscaldi",
        "Sonia Vanier",
        "Aymen Shabou"
      ],
      "abstract": "Detecting tampered text in document images is a challenging task due to data scarcity. To address this, previous work has attempted to generate tampered documents using rule-based methods. However, the resulting documents often suffer from limited variety and poor visual quality, typically leaving highly visible artifacts that are rarely observed in real-world manipulations. This undermines the model's ability to learn robust, generalizable features and results in poor performance on real-world data. Motivated by this discrepancy, we propose a novel method for generating high-quality tampered document images. We first train an auxiliary network to compare text crops, leveraging contrastive learning with a novel strategy for defining positive pairs and their corresponding negatives. We also train a second auxiliary network to evaluate whether a crop tightly encloses the intended characters, without cutting off parts of characters or including parts of adjacent ones. Using a carefully designed generation pipeline that leverages both networks, we introduce a framework capable of producing diverse, high-quality tampered document images. We assess the effectiveness of our data generation pipeline by training multiple models on datasets derived from the same source images, generated using our method and existing approaches, under identical training protocols. Evaluating these models on various open-source datasets shows that our pipeline yields consistent performance improvements across architectures and datasets.",
      "pdf": "https://arxiv.org/pdf/2602.17322v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17322v1",
      "abs_url": "https://arxiv.org/abs/2602.17322v1",
      "published": "2026-02-19"
    },
    {
      "title": "The Sound of Death: Deep Learning Reveals Vascular Damage from Carotid Ultrasound",
      "authors": [
        "Christoph Balada",
        "Aida Romano-Martinez",
        "Payal Varshney",
        "Vincent ten Cate",
        "Katharina Geschke",
        "Jonas Tesarz",
        "Paul Claßen",
        "Alexander K. Schuster",
        "Dativa Tibyampansha",
        "Karl-Patrik Kresoja",
        "Philipp S. Wild",
        "Sheraz Ahmed",
        "Andreas Dengel"
      ],
      "abstract": "Cardiovascular diseases (CVDs) remain the leading cause of mortality worldwide, yet early risk detection is often limited by available diagnostics. Carotid ultrasound, a non-invasive and widely accessible modality, encodes rich structural and hemodynamic information that is largely untapped. Here, we present a machine learning (ML) framework that extracts clinically meaningful representations of vascular damage (VD) from carotid ultrasound videos, using hypertension as a weak proxy label. The model learns robust features that are biologically plausible, interpretable, and strongly associated with established cardiovascular risk factors, comorbidities, and laboratory measures. High VD stratifies individuals for myocardial infarction, cardiac death, and all-cause mortality, matching or outperforming conventional risk models such as SCORE2. Explainable AI analyses reveal that the model relies on vessel morphology and perivascular tissue characteristics, uncovering novel functional and anatomical signatures of vascular damage. This work demonstrates that routine carotid ultrasound contains far more prognostic information than previously recognized. Our approach provides a scalable, non-invasive, and cost-effective tool for population-wide cardiovascular risk assessment, enabling earlier and more personalized prevention strategies without reliance on laboratory tests or complex clinical inputs.",
      "pdf": "https://arxiv.org/pdf/2602.17321v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17321v1",
      "abs_url": "https://arxiv.org/abs/2602.17321v1",
      "published": "2026-02-19"
    },
    {
      "title": "Flickering Multi-Armed Bandits",
      "authors": [
        "Sourav Chakraborty",
        "Amit Kiran Rege",
        "Claire Monteleoni",
        "Lijun Chen"
      ],
      "abstract": "We introduce Flickering Multi-Armed Bandits (FMAB), a new MAB framework where the set of available arms (or actions) can change at each round, and the available set at any time may depend on the agent's previously selected arm. We model this constrained, evolving availability using random graph processes, where arms are nodes and the agent's movement is restricted to its local neighborhood. We analyze this problem under two random graph models: an i.i.d. Erdős--Rényi (ER) process and an Edge-Markovian process. We propose and analyze a two-phase algorithm that employs a lazy random walk for exploration to efficiently identify the optimal arm, followed by a navigation and commitment phase for exploitation. We establish high-probability and expected sublinear regret bounds for both graph settings. We show that the exploration cost of our algorithm is near-optimal by establishing a matching information-theoretic lower bound for this problem class, highlighting the fundamental cost of exploration under local-move constraints. We complement our theoretical guarantees with numerical simulations, including a scenario of a robotic ground vehicle scouting a disaster-affected region.",
      "pdf": "https://arxiv.org/pdf/2602.17315v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17315v1",
      "abs_url": "https://arxiv.org/abs/2602.17315v1",
      "published": "2026-02-19"
    },
    {
      "title": "Open Datasets in Learning Analytics: Trends, Challenges, and Best PRACTICE",
      "authors": [
        "Valdemar Švábenský",
        "Brendan Flanagan",
        "Erwin Daniel López Zapata",
        "Atsushi Shimada"
      ],
      "abstract": "Open datasets play a crucial role in three research domains that intersect data science and education: learning analytics, educational data mining, and artificial intelligence in education. Researchers in these domains apply computational methods to analyze data from educational contexts, aiming to better understand and improve teaching and learning. Providing open datasets alongside research papers supports reproducibility, collaboration, and trust in research findings. It also provides individual benefits for authors, such as greater visibility, credibility, and citation potential. Despite these advantages, the availability of open datasets and the associated practices within the learning analytics research communities, especially at their flagship conference venues, remain unclear. We surveyed available datasets published alongside research papers in learning analytics. We manually examined 1,125 papers from three flagship conferences (LAK, EDM, and AIED) over the past five years. We discovered, categorized, and analyzed 172 datasets used in 204 publications. Our study presents the most comprehensive collection and analysis of open educational datasets to date, along with the most detailed categorization. Of the 172 datasets identified, 143 were not captured in any prior survey of open data in learning analytics. We provide insights into the datasets' context, analytical methods, use, and other properties. Based on this survey, we summarize the current gaps in the field. Furthermore, we list practical recommendations, advice, and 8-item guidelines under the acronym PRACTICE with a checklist to help researchers publish their data. Lastly, we share our original dataset: an annotated inventory detailing the discovered datasets and the corresponding publications. We hope these findings will support further adoption of open data practices in learning analytics communities and beyond.",
      "pdf": "https://arxiv.org/pdf/2602.17314v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17314v1",
      "abs_url": "https://arxiv.org/abs/2602.17314v1",
      "published": "2026-02-19"
    },
    {
      "title": "LexiSafe: Offline Safe Reinforcement Learning with Lexicographic Safety-Reward Hierarchy",
      "authors": [
        "Hsin-Jung Yang",
        "Zhanhong Jiang",
        "Prajwal Koirala",
        "Qisai Liu",
        "Cody Fleming",
        "Soumik Sarkar"
      ],
      "abstract": "Offline safe reinforcement learning (RL) is increasingly important for cyber-physical systems (CPS), where safety violations during training are unacceptable and only pre-collected data are available. Existing offline safe RL methods typically balance reward-safety tradeoffs through constraint relaxation or joint optimization, but they often lack structural mechanisms to prevent safety drift. We propose LexiSafe, a lexicographic offline RL framework designed to preserve safety-aligned behavior. We first develop LexiSafe-SC, a single-cost formulation for standard offline safe RL, and derive safety-violation and performance-suboptimality bounds that together yield sample-complexity guarantees. We then extend the framework to hierarchical safety requirements with LexiSafe-MC, which supports multiple safety costs and admits its own sample-complexity analysis. Empirically, LexiSafe demonstrates reduced safety violations and improved task performance compared to constrained offline baselines. By unifying lexicographic prioritization with structural bias, LexiSafe offers a practical and theoretically grounded approach for safety-critical CPS decision-making.",
      "pdf": "https://arxiv.org/pdf/2602.17312v1",
      "pdf_url": "https://arxiv.org/pdf/2602.17312v1",
      "abs_url": "https://arxiv.org/abs/2602.17312v1",
      "published": "2026-02-19"
    }
  ]
}